[
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc1NDc0",
    "description": "From multinational to entrepreneur, from embedded to enterprise -- the growth and engagement of the RISC-V community continues to skyrocket around the world and across industries. Let's get deep in the data to appreciate the fastest growing new workloads and strategic shifts igniting investment in RISC-V.",
    "url": "https://player.vimeo.com/video/488618254?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-08T19:00:00+00:00",
    "utcendtime": "2020-12-08T19:20:00+00:00",
    "title": "RISC-V Unconstrained Growth and Opportunity",
    "topic": "Keynote Program",
    "kind": "Keynote",
    "presenter": "Calista Redmond · RISC-V International",
    "organization": null
  },
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc1NDc1",
    "description": "Western Digital shares how RISC-V fits into their storage products and data center solutions. Updates on the open source SweRV Cores as well as the cache coherent memory fabric OmniXtend are among the technology to be discussed.",
    "url": "https://player.vimeo.com/video/488620653?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-08T19:20:00+00:00",
    "utcendtime": "2020-12-08T19:32:00+00:00",
    "title": "RISC-V for Next Generation Storage & Compute",
    "topic": "Keynote Program",
    "kind": "Keynote",
    "presenter": "Siva Sivaram · Western Digital",
    "organization": null
  },
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc1NDc2",
    "description": "With the predicted explosion of data over the coming decade, Seagate is investing in novel solutions to enable data protection, movement, and storage. As an active participant in the RISC-V community, Seagate sees the RISC-V open ISA as central to solving these data challenges. Seagate will present domain-specific use cases, status of processor development, and a vision for future applications.",
    "url": "https://player.vimeo.com/video/488621153?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-08T19:32:00+00:00",
    "utcendtime": "2020-12-08T19:44:00+00:00",
    "title": "RISC-V Accelerating Innovation in Data Storage",
    "topic": "Keynote Program",
    "kind": "Keynote",
    "presenter": "John Morris · Seagate Technology",
    "organization": null
  },
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc1NDc3",
    "description": null,
    "url": "https://player.vimeo.com/video/488621685?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-08T19:45:00+00:00",
    "utcendtime": "2020-12-08T19:57:00+00:00",
    "title": "RISC-V: Good to Great",
    "topic": "Keynote Program",
    "kind": "Keynote",
    "presenter": "Patrick Little · SiFive",
    "organization": null
  },
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc1NTc2",
    "description": "The RISC-V vector extension has been designed to support complex arithmetic operations which operate over an array of data items to enable acceleration of computationally intensive tasks such as AI/ML and deep learning. The flexible architecture design requires target implementations to support a very large combination of input/output values for all the instructions. This scales up the complexity of ensuring the functional correctness of vector instructions and their interoperability with other system components such as MMU, caches, interrupts resulting in a huge challenge for the verification engineers. Writing directed tests for these combinations will be a long drawn process with high development costs and susceptible to manual errors.  In this session, we present a hybrid approach implemented in STING design verification tool which involves a mix of constrained random, graph based test generation and directed testing guided with coverage results, to get maximum possible verification throughput. The high level design choices in the tool to address randomization of SEW, LMUL and related CSRs, while ensuring that the resulting test is architecturally correct at the same time, will also be covered. The methodology allowed the stimulus to be very configurable with a high degree of interaction with other subsystems of the CPU, and as a result was very successful in finding a lot of bugs in a number of open source simulators and RTL implementations. Key Takeaways Introduction to a new verification approach for RISC-V  Challenges associated with the verification of the Vector specification",
    "url": "https://player.vimeo.com/video/488622727?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-08T20:00:00+00:00",
    "utcendtime": "2020-12-08T20:20:00+00:00",
    "title": "Learnings from Verification of RISC-V Vector Specification",
    "topic": "Verification",
    "kind": "Conference",
    "presenter": "Jevin Saju John · Valtrix Systems",
    "organization": null
  },
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc1NDgx",
    "description": "Floating-point (FP) arithmetic is essential in many applications of the Internet-of-Things (IoT) domain. In programmable devices, FP operations can be performed by dedicated instructions or by software emulation. For applications that use FP operations only sporadically, software emulation is a suitable solution as it avoids the use of expensive datapaths. In contrast, when FP instructions dominate the application, having a performant hardware floating-point unit (FPU) is better. However, both the extra area required by a full-fledged FPU and the code size overhead, introduced by the software functions to emulate FP instructions on the integer datapath, are too expensive for low-cost microcontrollers. We present an IEEE-754-2008-compliant RISC-V FPU (Tiny-FPU) optimized for circuit area while being higher-performance than the software emulation functions provided by the GCC low-level runtime library (libgcc). A small RISC-V core coupled with Tiny-FPU achieves up to 15.5x and 18.5x speedup compared to the same integer-only core using software emulation when executing intensive single- and double-precision FP workloads, respectively. Tiny-FPU exploits multi-cycle execution to use fewer and smaller components in a time-multiplexed fashion, reducing the area by 37% for a single-precision implementation and by 53% for a double-precision one compared to a high-performance and energy-efficient FPU. The proposed FPU can compute additions, multiplications, fused multiply-adds, comparisons, sign injections, and casts. Key Takeaways Design trade-offs for FPUs Floating-Point acceleration on the edge Methods for area optimization",
    "url": "https://player.vimeo.com/video/488616999?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-08T20:00:00+00:00",
    "utcendtime": "2020-12-08T20:20:00+00:00",
    "title": "A Tiny RISC-V Floating-Point Unit",
    "topic": "System Architectures",
    "kind": "Conference",
    "presenter": "Luca Bertaccini · ETH Zurich",
    "organization": null
  },
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc1NDgw",
    "description": "This talk will present the journey of Intensivate in developing the first commercial Cluster CPU, with a focus on how the RISC-V eco-system enables delivering a commercially viable chip, in a 12nm process node, into customer hands at less than $10M.Audience members will hear the ways in which the cost to deliver such as chip has been reduced, including the role that the RISC-V software ecosystem played, the role of the Rocket-Chip RTL available from Chip Yard, the role of FireSim FPGA emulation system, and the role of the Chisel hardware language.Key TakeawaysIf you have an idea, it is indeed possible to bring it to market on less than $10M.Cost reduction derived from: SW eco-system (OS, toolchain) -- Open Source RTL (Rocket-Chip, chipyard) -- Emulation (FireSim)Chisel plus FireSim enabled FPGA centric development -- time to modify RTL not far from time to modify software simulator -- but at a cost",
    "url": "https://player.vimeo.com/video/488617218?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-08T20:00:00+00:00",
    "utcendtime": "2020-12-08T20:20:00+00:00",
    "title": "Leveraging the RISC-V Eco-System to Put a Chip in Customer Hands in less than $10M",
    "topic": "Community Ecosystem",
    "kind": "Conference",
    "presenter": "Sean Halle · Intensivate",
    "organization": null
  },
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc1NDc4",
    "description": "By moving closer to the edge, machine learning is profoundly changing the IoT landscape, where RISC-V is already seeing immense success. To be able to fully capitalize on the opportunities that arise from this trend, as well as tackle the related challenges, various communities must come together to create an open ecosystem of modern tools, frameworks and platforms that together will constitute a seamless environment for developers to build advanced ML applications on RISC-V.The keynote panel will feature Tim Ansell (Google), Kate Stewart (Zephyr Project), Brian Faith (QuickLogic) and Michael Gielda (Antmicro) in a discussion of how the strengths of RISC-V, Zephyr RTOS, TensorFlow Lite and Renode can be combined to provide collaborative, software-driven, traceable ML development for the very edge. The participants will discuss how the vendor-neutral approach of RISC-V resonates with the foundational principles of the Zephyr RTOS and the Renode simulation framework, and how TensorFlow Lite Micro can leverage the open ISA and its tools to innovate in the ML domain also on the hardware level, e.g. using FPGAs or custom extensions. The discussion will also touch upon modern testing methodologies and HW-SW co-development enabled by Renode - already employed by Zephyr, Google’s TF Lite Team and QuickLogic - enabling efficient, deterministically testable ML development on RISC-V.",
    "url": "https://player.vimeo.com/video/488622023?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-08T20:00:00+00:00",
    "utcendtime": "2020-12-08T20:30:00+00:00",
    "title": "Building an Open Edge Machine Learning Ecosystem with RISC-V, Zephyr, TensorFlow Lite Micro and Renode",
    "topic": "Keynote Program",
    "kind": "Keynote",
    "presenter": "Tim Ansell · Google",
    "organization": null
  },
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc1NTc1",
    "description": " In this talk we present about how to effectively deploy SystemC based ESL flows for the design and verification of RISC-V based SoC. The term ‘Electronics System Level (ESL)’ have been used in the industry for nearly two decades now. Different people use it in different context, with different meanings. It can be primarily generalized as the collection of methodologies that enables ‘Hardware-Software Co-Design’ and ‘Raising the abstraction of chip design above RTL’. The different technologies that are used to enable ESL methodologies are: C, C++, SystemC / TLM2.0 (IEEE 1666-2011), Python, UPF3.0 (IEEE1801-2015), IP-XACT (IEEE1685-2014), Portable Stimulus (new Accellera standard). ESL methodologies are not supposed to replace the traditional RTL-GDS flow, but rather co-exist with existing flow and augment it to perform various advanced activities which are not feasible with traditional flow. It enables Pre-Silicon firmware development, Architecture exploration to optimize power & performance early in the cycle at system level, High-Level Synthesis (HLS), SoC Level simulation, System level simulation, Hardware-Software co-design and co-verification. Some re-usable modelling infrastructure can be developed for RISC-V, that helps the companies to quickly deploy ESL methodologies in their flow.  Key Takeaways You will learn how to effectively deploy SystemC based ESL flows for the design and verification of RISC-V based SoC.  ",
    "url": "https://player.vimeo.com/video/488617485?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-08T20:20:00+00:00",
    "utcendtime": "2020-12-08T20:30:00+00:00",
    "title": "Tech Talk with CircuitSutra Technologies: Fast Forward your RISC-V SoC launch using SystemC based Shift-Left ESL methodologies",
    "topic": "Tech Talk",
    "kind": "Tech Talk",
    "presenter": "Umesh Sisodia · CircuitSutra",
    "organization": null
  },
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc1NTcz",
    "description": "In the last decade, virtualization has become a key-enabling technology not only for servers but also for several embedded industries such as automotive and industrial control. As these typically have mixed-criticality requirements, static partitioning hypervisors, which feature minimal trusted computing bases, are a perfect fit for achieving consolidation while guaranteeing freedom-from-interference, but often depend on hardware virtualization support. The RISC-V hypervisor extension specification draft is reaching a state of full maturity, but, unfortunately, it is not yet ratified, which means no silicon featuring full hardware virtualization support is available and will probably not be for the foreseeable future.We've ported Bao, an open-source static partitioning hypervisor, to RISC-V using the QEMU hypervisor extension implementation. To perform a meaningful and realistic evaluation of Bao, we've implemented the latest version of the hypervisor extension specification (v0.6) in Rocket Chip and carried out experiments using Firesim, a cycle-accurate, FPGA-accelerated simulator. After our initial implementation, we've enhanced Rocket with hypervisor-controlled hardware mechanisms to minimize inter-hart interference due to contention in shared memory access structures (e.g., L2 cache and DRAM controller). Furthermore, we've extended the PLIC to take advantage of guest external interrupt support and achieve direct guest interrupt injection with low and deterministic latency to critical guest OSes.In this talk we report our experience with the RISC-V hypervisor extension, present the first publicly unveiled benchmark of a hypervisor running over the extensions, and layout the next steps on how to achieve efficient static partitioning virtualization on RISC-V.Key TakeawaysCurrent state of the RISC-V hypervisor extensions.First public implementation and evaluation of the hypervisor extensions specification in a RISC-V core.What is static partitioning virtualization and what hardware supports it needs to be done efficiently.",
    "url": "https://player.vimeo.com/video/488627081?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-08T20:30:00+00:00",
    "utcendtime": "2020-12-08T20:50:00+00:00",
    "title": "Static Partitioning Virtualization on RISC-V",
    "topic": "System Architectures",
    "kind": "Conference",
    "presenter": "Sandro Pinto · Universidade do Minho",
    "organization": null
  },
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc1NTcy",
    "description": "This talk touches upon the problem of post-silicon verification of RISC-V microprocessors and development of online test program generators (OTPG). OTPG is a bare-metal application, producing binary code, executing it, and checking results. The proposed OTPG follows the MicroTESK (Microprocessor TEsting and Specification Kit) approach to development of test program generators for functional verification of microprocessors, separating the ISA-independent generation core from the formal specification of RISC-V ISA. MicroTESK OTPG reuses ISA specifications written in the nML language from pre-silicon version of MicroTESK. MicroTESK's RISC-V specifications currently include the following subsets: RV32I, RV64I, RV32M, RV64M, RV32A, RV64A, RV32F, RV64F, RV32D, RV64D, RV32C, RV64C, RV32V. In total, the specifications cover about 250 instructions and can be easily modified to support more instructions. The proposed OTPG has its own separated generation core (in C) and inherits the ISA specifications to allow quick start of post-silicon verification activities. MicroTESK for RISC-V (together with the correspondent OTPG) is distributed under Apache License, Version 2.0.Key TakeawaysThe audience will learn how MicroTESK approach to pre-silicon verification has been extended to the post-silicon case. We will briefly look at recent advances in MicroTESK for RISC-V, including support for new instruction subsets.",
    "url": "https://player.vimeo.com/video/488625350?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-08T20:30:00+00:00",
    "utcendtime": "2020-12-08T20:50:00+00:00",
    "title": "Open-source Online-TPG for RISC-V Microprocessors",
    "topic": "Verification",
    "kind": "Conference",
    "presenter": "Alexander Kamkin · ISP RAS",
    "organization": null
  },
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc1NTc0",
    "description": "Space applications have a number of functional safety requirements that need to be leveraged with a number of additional requirements such as increasing performance needs, limited power, weight and volume envelopes, high testability for online debugging and updates, a relatively small market, and as much freedom from export restrictions as possible to name a few.This talk will introduce the De-RISC platform, a new RISC-V based hardware and software platform reconciling all those requirements. In particular, this talk will start exposing end user requirements for space applications, and how they can be realistically achieved with appropriate platform support. Then, we will introduce the XtratuM hypervisor and LithOS RTOS by fentISS, which form the system software layer of the De-RISC platform. We will detail their main features, how they meet end user applications requirements, and what requirements they pose on the hardware layer. Finally, Gaisler's NOEL-V based MPSoC – the hardware layer of De-RISC – will be presented with particular emphasis on how this MPSoC delivers the features needed by the system software to guarantee a safe execution of space applications by means of advanced hardware monitoring support and safety mechanisms.The talk will focus on the design aspects of the De-RISC platform, the goals, achievements and milestones of the De-RISC project, whose objective is to produce the first RISC-V multicore space-certifiable platform of an entirely European development, and will provide prospects towards its validation and assessment, which will occur during 2021.Key TakeawaysSafety requirements from the user perspectiveSoftware (hypervisor) mechanisms for safetyHardware support for enforcing safety mechanismsInsights about how safety needs in space platforms are holistically tackled",
    "url": "https://player.vimeo.com/video/488634311?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-08T20:30:00+00:00",
    "utcendtime": "2020-12-08T20:50:00+00:00",
    "title": "Tackling Safety in Space with RISC-V Based Platforms",
    "topic": "Security & Functional Safety",
    "kind": "Conference",
    "presenter": "Jaume Abella · Barcelona Supercomputing (BSC)",
    "organization": null
  },
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc1NTcx",
    "description": "A quick introduction to FORCE-RISCV Instruction Stream Generator. FORCE-RISCV is an open source Instruction Stream Generator (ISG). It is a powerful verification tool for RISC-V based CPU design. The open source code is available at: https://github.com/openhwgroup/force-riscv. Session Takeaways:  Learn the unique capabilities and strength of FORCE-RISCV ISG and realize potential benefits of introducing FORCE-RISCV ISG to their RISC-V based CPU or SoC projects. Attract interest to the FORCE-RISCV ISG tutorial session.",
    "url": "https://player.vimeo.com/video/488634671?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-08T20:50:00+00:00",
    "utcendtime": "2020-12-08T21:00:00+00:00",
    "title": "Tech Talk with Futurewei: FORCE-RISCV Instruction Stream Generator",
    "topic": "Tech Talk",
    "kind": "Tech Talk",
    "presenter": "Jingliang Wang · Futurewei Technologies",
    "organization": null
  },
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc1NTY5",
    "description": "Cobham Gaisler AB has a long heritage in the space industry, with SPARC based LEON processors and GRLIB IP components. We provide both IP and space qualified chips.The NOEL-V processor family, which is based on the RISC-V ISA, is a new addition to our line of processors. The first variant, HPP64, is a 64-bit high-performance in-order dual-issue processor, with an initial version already released and different configurations under development. This variant has a 7-stage pipeline, can achieve 4.69 Coremark/MHz by initial estimates and supports RV64GCBNH (some extensions are under development). The NOEL-V processors are open sourced under the GPL license. Fault tolerance and additional components for high performance, like L2-cache and a pipelined FPU, can be licensed commercially. The NOEL-V processors are embedded in Gaisler's GRLIB IP library, making it possible to build systems around them using GRLIB. Like all GRLIB IP, the NOEL-V core is written in readable VHDL.The GPL release of the NOEL-V from early summer 2020 runs Linux, but work is ongoing to improve and extend the core. Availability of RISC-V ecosystem tools like the Spike simulator greatly helped with the development and verification of the processor. An in-house random instruction generator was developed and Spike simulation results are used to verify hardware simulations. With some slight modifications to Spike we could even use it to verify NOEL-V hardware simulation running Linux.Key TakeawaysA new high-performance RISC-V core is presented.Commercial and open source, how can it work?Using open source GRLIB IP to build RISC-V systems.",
    "url": "https://player.vimeo.com/video/488634948?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-08T21:00:00+00:00",
    "utcendtime": "2020-12-08T21:20:00+00:00",
    "title": "NOEL-V: A new high-performance RISC-V processor family",
    "topic": "Hardware Cores/SoCs",
    "kind": "Conference",
    "presenter": "Alen Bardizbanyan · Cobham Gaisler AB",
    "organization": null
  },
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc1NTY4",
    "description": "With quantum computers at the horizon, the security of existing asymmetric cryptographic algorithms (e.g., RSA and ECC) is about to be broken. The dawning post-quantum age demands for hardware platforms, which support fast and energy-efficient execution of new quantum-resistant cryptosystems. For this, the flexible RISC-V architecture and its advanced instruction set features offer a great opportunity to realize post-quantum cryptography. This paper focuses on how we can exploit the most recent RISC-V Vector Extension Version 0.9 (RVV0.9) to accelerate the quantum-resistant McEliece cryptosystem, which is currently a NIST finalist of the post-quantum standardization. The most expensive calculations in this cryptosystem is the Galois Field multiplication and the Gaussian Elimination Algorithm (GEA). The GEA is essential for the security of the cryptosystem as it scrambles the public key. This scrambling offers a very good potential for acceleration by vector instructions of the RVV extension. In order to evaluate the possible gains,we adopted a rapid prototyping approach based on an instruction set simulator (ISS). We extended the simulator ETISS with a SoftVector library, which allows to quickly model the instructions of RVV. Using the rapid prototyping environment, the GEA was re-implemented and verified for RVV0.9 with a variable size of VLEN and SEW. The final performance gain depends heavily on the memory interface of the vector unit.For different configurations of the memory system, we could profile performance gains of 6x up to 18x for the GEA. This clearly shows the benefit of RVV for implementing quantum-resistant cryptosystems. Key Takeaways: First showcase of the acceleration of a post-quantum cryptography algorithm using the RISC-V Vector Extension (RVV0.9). Functional validation and performance profiling with Instruction Set Simulator ETISS using SoftVector, an arithmetic library for vector computations supporting RVV0.9. ETISS is open source available to the RISC-V community. Performance profiling shows a high potential for acceleration using the V-Extension of 6x up to 18x for a key part of the cryptographic algorithm. Speed-up depends heavily on the memory interface. RVV boosts post-quantum cryptography.",
    "url": "https://player.vimeo.com/video/488635306?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-08T21:00:00+00:00",
    "utcendtime": "2020-12-08T21:20:00+00:00",
    "title": "Exploring the RISC-V Vector Extension for Efficient Post-Quantum Cryptography",
    "topic": "Security & Functional Safety",
    "kind": "Conference",
    "presenter": "Alexander Zeh · Hensoldt Cyber",
    "organization": null
  },
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc1NTY3",
    "description": "SystemVerilog is a hardware description language used to create and test digital designs, including RISC-V cores. However, most available tools for working with SystemVerilog are proprietary, which prevents them from being widely used in Continuous Integration systems. Also, there’s a range of open source RISC-V cores and IPs implemented in SystemVerilog, which cannot yet be built with open source tools. The same holds true for multiple open source design verification tools, that still can be plugged only into proprietary tooling, holding back the ASIC and FPGA design ecosystem from becoming collaborative and modular. In this talk we will present a number of efforts involving Antmicro aimed at building an open source SystemVerilog ecosystem of scalable and reusable solutions. The presentation will describe the SystemVerilog compliance suite for running various tests against open source tools, the Verible linter/formatter that we develop with Google, as well as the SystemVerilog 2017 pre-processor and parser Surelog, which we are integrating with UHDM. Together with Google we are also working towards integrating it with various open source tools via UHDM, while our collaboration with Western Digital and CHIPS Alliance around Verilator aims to add SystemVerilog features required by UVM. Session Takeaways The audience will learn about the ongoing open source projects that Antmicro and their collaborators are working on to improve ASIC and FPGA design flows.",
    "url": "https://player.vimeo.com/video/488624874?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-08T21:20:00+00:00",
    "utcendtime": "2020-12-08T21:30:00+00:00",
    "title": "Tech Talk with Antmicro: Building an open source SystemVerilog ecosystem",
    "topic": "Tech Talk",
    "kind": "Tech Talk",
    "presenter": "Karol Gugala · Antmicro",
    "organization": null
  },
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc1NTY2",
    "description": "With the slowing of Moore's Law and the success of the RISC-V ISA there has been a renewed interest in developing truly open integrated circuits (IC). Tim 'mithro' Ansell has spent the last 2 years working at Google trying to remove roadblocks and enable future chips to be open all the way down to the transistor. In this session you will learn about how a modern integrated circuit is developed including what software tooling and manufacturing data is needed to build them. The talk will include a background on existing resources, information on both the new DARPA programs enabling new tooling and the new resources Google has released (including a new open source PDK), and finally it will detail the results of the first free and open shuttle program which has been enabling everyone (academics, hobbyists and companies) to create integrated circuits that are open down to the transistor! Key Takeaways Learn more about all the elements needed to create fully open ASICs Understand sinificance of first-of-a-kind contribution that is the open source PDK from Google and SkyWater Learn about the effects of new open source free shuttle program offered by Google and efabless Hear about future plans and growth of ecosystem",
    "url": "https://player.vimeo.com/video/488624887?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-08T21:30:00+00:00",
    "utcendtime": "2020-12-08T21:50:00+00:00",
    "title": "Fully Open Source Manufacturable PDK for a 130nm Process",
    "topic": "Community Ecosystem",
    "kind": "Conference",
    "presenter": "Tim Ansell · Google",
    "organization": null
  },
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc1NTY1",
    "description": "Convolutional computation kernels are fundamental to today's edge computing applications, among the algorithms used for classification and signal processing applications running on the edge. Interleaved-Multi-Threading (IMT) processor cores are an interesting approach to pursue the highest energy efficiency and lowest hardware cost in edge computing systems, yet they need hardware acceleration schemes to deal with heavy computational workloads like convolutional algorithms and others. Following a vector approach to accelerate convolutions, we explore possible alternatives to implement vector co-processing units in IMT cores, showing the application-dependence of the optimal balance among the hardware architecture parameters. The configurability of the micro-architecture design makes it an optimal candidate for adaptive co-processors in soft-core implementations.Key TakeawaysThe audience will get hints about the trade offs in vector co-processor design for simple edge computing cores, paired with interleaved multi-threading for maximizing efficiency. The small, custom instruction extension sufficient to support typical vector operations in a tiny soft core will be presented. A complete yet very simple library of intrinsic functions to support application development will be presented. Example of source code exploiting the co-processor instructions will be shown. References to the open-source Klessydra processor core family will be given.",
    "url": "https://player.vimeo.com/video/488625196?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-08T21:30:00+00:00",
    "utcendtime": "2020-12-08T21:50:00+00:00",
    "title": "Klessydra-T: Designing Configurable Vector Co-Processors for Multi-Threaded Edge-Computing Soft-Cores",
    "topic": "Hardware Cores/SoCs",
    "kind": "Conference",
    "presenter": "Mauro Olivieri · Sapienza University of Rome",
    "organization": null
  },
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc1NTY0",
    "description": "Every day more devices are connected to the internet in new verticals. The growing number of IoT products and the complexity of them, however, introduces new challenges particularly for device makers and digital service providers that are not security experts. GlobalPlatform has a proven track record in helping the IoT device ecosystem to bring secure devices to market and enable the privacy of data exchanged between them. By standardizing and certifying secure component technologies - Secure Element (SE), Trusted Execution Environment (TEE) and Microcontrollers (MCU) – the association is enabling new IoT use cases across multiple verticals. From telecommunication and payments, to automotive and government. GlobalPlatform is therefore well placed to support the adoption of TEE technology based on RISC-V architecture, as the de-facto enhanced secure environment for connected devices. This is especially important in the IoT world, where more work is needed to help device makers in specific verticals to connect new 'things', such as control commands for smart home devices for example. This presentation will explain why standardized device architecture, as well as Application Programming Interfaces (APIs) and associated training, compliance and security certification schemes, are critical to achieving this. It will describe the architecture of a TEE and the different Application Programming Interfaces (APIs) enabling the development of secure services within a device, including the Trusted User Interface (TUI). Delegates will also learn about the value of TEE compliance and security certification schemes in supporting major technology players and enabling IoT use cases, with real world examples. Key Takeaways   What is a Trusted Execution Environment?    What value does standardizing TEE technology bring to the IoT ecosystem?    The step by step roadmap for a successful TEE based on RISC-V architecture.",
    "url": "https://player.vimeo.com/video/488625336?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-08T21:30:00+00:00",
    "utcendtime": "2020-12-08T21:50:00+00:00",
    "title": "Standardizing the TEE with GlobalPlatform and RISC-V – The IoT Opportunity",
    "topic": "Security & Functional Safety",
    "kind": "Conference",
    "presenter": "Gil Bernabeu · GlobalPlatform",
    "organization": null
  },
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc1NTYz",
    "description": "Join us for this live-in-zoom session to meet the speakers and ask follow up questions from today's presentations.  ",
    "url": "https://player.vimeo.com/video/488625051?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-08T21:50:00+00:00",
    "utcendtime": "2020-12-08T22:30:00+00:00",
    "title": "LIVE Q&A Forum with Speakers: Room A",
    "topic": "Meet the Speakers: Room A",
    "kind": "Meet the Speakers",
    "presenter": "Shubhodeep Choudhury · Valtrix Systems",
    "organization": null
  },
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc1NTYy",
    "description": "Join us for this live-in-zoom session to meet the speakers and ask follow up questions from today's presentations. ",
    "url": "https://player.vimeo.com/video/488625051?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-08T21:50:00+00:00",
    "utcendtime": "2020-12-08T22:30:00+00:00",
    "title": "LIVE Q&A Forum with Speakers: Room B",
    "topic": "Meet the Speakers: Room B",
    "kind": "Meet the Speakers",
    "presenter": "Gil Bernabeu · GlobalPlatform",
    "organization": null
  },
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc1NTYx",
    "description": "RISC-V software is making major strides. This talk gives an overview of the state of the union for RISC-V software. It also discusses the major software developments over the last year as well as goals and focus areas for 2021. Key Takeaways Attendees will walk away with a good grasp of the overall RISC-V software ecosystem, especially major developments over the last year. They will also learn how they can contribute to RISC-V software and help grow the ecosystem.",
    "url": "https://player.vimeo.com/video/488625051?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-08T22:30:00+00:00",
    "utcendtime": "2020-12-08T22:50:00+00:00",
    "title": "RISC-V Software State of the Union",
    "topic": "Software & Tools",
    "kind": "Conference",
    "presenter": "Arun Thomas · Draper Laboratory",
    "organization": null
  },
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc1NTYw",
    "description": "AI is moving from the enterprise core to the edge and endpoints. These intelligent systems require heterogenous combinations of compute, storage and acceleration. The RISC-V vector extension is a fundamental requirement for enabling computational intelligence. RISC-V vectors enable the implementation of diverse compute architectures for the spectrum of power and performance constraints required to scale from end points to the edge. It is also key in maintaining software portability across applications from endpoints to the edge therby reducing total cost of operation. SiFive's Vector Intelligence Core IP is architected to enable heterogeneous compute by providing a scalable portfolio of RISC-V vector-enabled CPU IP which can be customized according to the application requirements. In this talk, we present the recent advancements in the RISC-V vector extension, comparisons to other architectures including Arm NEON/Helium/MVE/SVE/SVE2, and recent advancements around extending and optimizing SiFive's vector core IP for intelligence at scale. Key Takeaways In this talk, we present the recent advancements in the RISC-V vector extension, comparisons to other architectures including Arm NEON/Helium/MVE/SVE/SVE2, and recent advancements around extending and optimizing SiFive's vector core IP for intelligence at scale.",
    "url": "https://player.vimeo.com/video/488624966?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-08T22:30:00+00:00",
    "utcendtime": "2020-12-08T22:50:00+00:00",
    "title": "RISC-V Vector Extensions for Scaling Intelligence to the Edge",
    "topic": "System Architectures",
    "kind": "Conference",
    "presenter": "Krste Asanovic · UC Berkeley | SiFive",
    "organization": null
  },
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc1NTU5",
    "description": "A 20-minute talk on Seagate's RISC-V verification environment for technical SOC design and verification engineers.The sessions will cover these topics:· RISC-V Compliance and Verification: Discuss RISC-V compliance and how compliance and verification are different.· Seagate's Verification Methodology: Describe details of Seagate's verification methodology used for its two families of RISC-V cores, covering instruction-level verification as well as asynchronous event stimulus.· Production-Quality Verification Considerations: Discuss some important verification considerations for creating production-quality processor cores. Highlight an example where production-quality verification methodology led to the discovery of a flaw in then-draft RISC-V Trace Specification that was able to be fixed before that standard went to ratification.· Example of Cathedral and Bazaar: Discuss how Seagate used a combination of commercially-sourced RISC-V verification infrastructure as well as internally-developed IP to achieve its goals. This has been a key differentiator of RISC-V, with many parties effectively able to share the development costs of high-quality instruction stream generators and models.Key TakeawaysAttendees will learn about the difference between compliance and verification and why both are important.Attendees will learn about how a robust RISC-V ecosystem is improving the accessibility and quality of processor core verification.Attendees will learn details about Seagate's production-quality RISC-V verification infrastructure and will be inspired to make improvements in their own efforts.",
    "url": "https://player.vimeo.com/video/488624818?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-08T22:30:00+00:00",
    "utcendtime": "2020-12-08T22:50:00+00:00",
    "title": "Comprehensive Pre-Si Verification of RISC-V Cores in a Storage Controller",
    "topic": "Verification",
    "kind": "Conference",
    "presenter": "Bill McSpadden · Seagate Technology",
    "organization": null
  },
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc1NTU4",
    "description": "The member organizations of the OpenHW Group have worked together to define and implement an open-source verification environment for CORE-V cores and related IP. This environment has been successfully deployed to execute a complete, end-to-end, top-to-bottom verification of the CV32E40P, an RV32IMC machine derived from the PULP Platform RI5CY core.  In this session we will briefly introduce the OpenHW Group and its top-down approach to verification. A primary goal of this Tech Talk to is motivate Summit participants to attend the hour-long tutorial session on Thursday will delve into the details of the simulation and formal verification applied to the CV32E40P project.    Key Takeaways    Introduction to the OpenHW Group and the CORE-V family of RISC-V cores.   General overview of the OpenHW Group verification philosophy and approach.   High-level overview of the simulation testbench and the collaborative workflow that produces industrial quality, open source IP.  ",
    "url": "https://player.vimeo.com/video/488624930?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-08T22:50:00+00:00",
    "utcendtime": "2020-12-08T23:00:00+00:00",
    "title": "Tech Talk with OpenHW Group: CORE-V Verification Test Bench",
    "topic": "Tech Talk",
    "kind": "Tech Talk",
    "presenter": "Mike Thompson · OpenHW Group",
    "organization": null
  }
]