[
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc1NTU3",
    "description": "Want to run Linux on open hardware? This talk will explore how the RISC-V, an open instruction set (ISA), and open source FPGA tools can be leveraged to achieve that goal.I will explain how myself and others at Hackaday Supercon teamed up to get Linux running on a RISC-V soft-core in the ECP5 FPGA on the conference badge. I will introduce Migen, LiteX and Vexriscv, and explain how they enabled us to quickly implement an SoC in the FPGA capable of running Linux.I will also explore other Linux-capable open source RISC-V implementations, and how some are being used in industry. I will highlight that OpenHW Group has adopted the PULP Ariane from ETH Zurich for its Core-V CVA64 implementation. Finally, I will look at what Linux-capable \"hard\" RISC-V SoC's currently exist, and what is on the horizon for 2020 and 2021.Key TakeawaysThis talk is should be relevant to people who are interested in building open hardware systems capable of running Linux. It should also be useful to people who are curious about RISC-V. Software engineers may find it exciting to learn how Python can be used to for chip-level design with Migen and LiteX, and simplify building a System-on-Chip (SoC) for an FPGA.",
    "url": "https://player.vimeo.com/video/488625177?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-08T23:00:00+00:00",
    "utcendtime": "2020-12-08T23:20:00+00:00",
    "title": "Linux on Open Hardware with RISC-V",
    "topic": "Community Ecosystem",
    "kind": "Conference",
    "presenter": "Drew Fustini · BeagleBoard.org Foundation",
    "organization": null
  },
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc1NTU2",
    "description": "Running state-of-the-art Deep Neural Network (DNN) models on top of a cheap and low-power microcontroller can be considered the holy grail of current research on edge embedded devices. This requires beating fundamental obstacles: 1) achieve a sufficient compute throughput within the allotted power envelope; 2) squeeze the DNN model footprint to better fit within restricted (< 1MB) on-chip memory resources; 3) minimize off-chip memory bandwidth if the DNN still cannot fit within on-chip memory. In this talk, we present the vertically integrated flow, fully open-source flow we designed to deploy DNNs on top of systems based on the RISC-V based PULP (Parallel Ultra-Low-Power) platform, such as GreenWaves Technologies GAP-8. Starting from DNN specification in a high-level framework (PyTorch), our flow uses open-source tools to cover all the steps for DNN deployment passing through mixed-precision quantization, memory-aware tensor tiling, down to optimized primitives used for execution on the PULP cores, augmented with the xPULP extensions to the RISC-V ISA. We showcase how the flow enables running mobile-grade DNNs in real-time on a GAP-8 SoC consuming less than 250 mW in the highest-performance operating point.Key TakeawaysUnderstand what makes deploying DNNs on low-power microcontrollers a challenging taskKnow the PULP RISC-V open-source hardware ecosystem and software tools for DNN deploymentUnderstand the advantages of an open-source, vertically integrated framework \"from Python to silicon\"",
    "url": "https://player.vimeo.com/video/488625310?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-08T23:00:00+00:00",
    "utcendtime": "2020-12-08T23:20:00+00:00",
    "title": "An Open-Source Flow for DNNs on Ultra-Low-Power RISC-V Cores",
    "topic": "Software & Tools",
    "kind": "Conference",
    "presenter": "Francesco Conti · University of Bologna",
    "organization": null
  },
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc1NTU1",
    "description": "When developing complex SOCs that incorporate RISC-V and other dissimilar processors, it is necessary to have a thorough understanding of the behavior and interaction of the processors. This session discusses and demonstrates advanced debug capability of heterogeneous SOC comprised of RISC-V and non-RISC-V processor cores. The advanced debug techniques include processor trace of RISC-V hardware. The debugging of RISC-V designs is greatly enhanced by the ability to use trace information to debug backwards and forwards along with re-debugging a traced program section.Key TakeawaysCommercial RISC-V based designs often include non-RISC-V processors and IPComprehensive debug of the design requires debugging all IP independently and concurrentlyTRACE32 allows you to define the interaction between separate processors cores in a complex SOCThe use of on-chip and off-chip trace provide a more complete way to debug complex SOC and better understand the interactions of all the processors.",
    "url": "https://player.vimeo.com/video/488682816?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-08T23:00:00+00:00",
    "utcendtime": "2020-12-08T23:20:00+00:00",
    "title": "Debug and Trace of Complex Heterogeneous SOC",
    "topic": "Software & Tools",
    "kind": "Conference",
    "presenter": "Dennis Griffith · Lauterbach",
    "organization": null
  },
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc1NTU0",
    "description": null,
    "url": "https://player.vimeo.com/video/488624908?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-08T23:20:00+00:00",
    "utcendtime": "2020-12-08T23:30:00+00:00",
    "title": "Tech Talk with SiFive: SiFive RISC-V Core IP Products",
    "topic": "Tech Talk",
    "kind": "Tech Talk",
    "presenter": "Drew Barbier · SiFive",
    "organization": null
  },
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc1NTUz",
    "description": "Esperanto Technologies has developed an accelerator chip for large-scale machine learning applications.In this talk, Esperanto provides an overview of the company's new ET-SoC-1, which features two kinds of general-purpose 64-bit RISC-V cores. The ET-Maxion, previewed at the RISC-V Summit in 2018, is a superscalar out-of-order core delivering high performance for modern operating systems and applications. The complementary ET-Minion is a leaner in-order multithreaded core with a large vector/tensor coprocessor designed from a clean sheet of paper for machine-learning applications.The chip's performance and efficiency comes from a combination of factors, including the simplicity of the RISC-V instruction set, Esperanto's proprietary instruction-set extensions for machine learning, wide vector/tensor units on every ET-Minion core, a uniquely optimized memory hierarchy, state of the art process technology, and custom low-voltage circuits. In this way, Esperanto delivers more performance per watt than competing fixed-function designs without compromising flexibility.The ET-SoC-1 accelerates every layer in machine-learning models, not just the simple ones. The presentation also describes Esperanto's software stack, which is based on Esperanto's RISC-V neural network compiler and industry-standard frameworks such as PyTorch, ONNX, and Glow. Coding to the hardware is unnecessary; Esperanto's PCI Express accelerator cards drop into existing systems and immediately deliver many times the performance of the best x86, GPU and FPGA solutions, taking data center performance density to previously unattained levels.Key TakeawaysEsperanto's new ET-SoC-1 features two kinds of general-purpose 64-bit RISC-V cores, the ET-Maxion and the ET-MinionThe ET-Minion is a lean in-order multithreaded core with a large vector/tensor coprocessor designed from a clean sheet of paper for machine-learning applicationsWith a uniquely optimized memory hierarchy, state of the art process technology, and custom low-voltage circuits, the ET-SoC-1 delivers more performance per watt than competing fixed-function ML accelerators without compromising flexibility",
    "url": "https://player.vimeo.com/video/488625041?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-08T23:30:00+00:00",
    "utcendtime": "2020-12-08T23:50:00+00:00",
    "title": "Esperanto Accelerates Machine Learning With RISC-V",
    "topic": "Hardware Cores/SoCs",
    "kind": "Conference",
    "presenter": "Art Swift · Esperanto Technologies",
    "organization": null
  },
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc1NTUy",
    "description": "Edge compute and storage infrastructures will increasingly drive autonomous decision-making processes, using data sets from a wide range of sensors. With a growing number of diverse data sets from varied sources, it can be challenging to guarantee the data's integrity. For example, academic research shows that manipulation of machine learning training data can create malicious backdoors in the model. We need to improve overall data trustworthiness to avoid manipulation of data driven automated decisions by increasing the trust of data capture devices and downstream data processing and storage systems. The end goal is an end-to-end trusted data ecosystem.In this talk, we discuss how a RISC-V based solution helps to protect data integrity by safeguarding its provenance. We created a proof-of-concept with off-the-shelf RISC-V hardcores, the open source Keystone Enclave Framework, implementing a Trusted Computing Group DICE based cryptographic identity, all secured by enclaves. The cryptographic device identities are then used to create verifiable integrity for data coming from a data capture device.Additionally, we consider how to improve the overall security of such a system with OpenTitan, an open-source silicon root of trust project. Although OpenTitan is still under development, we show how it benefits a data-storage environment and discuss how it helps to improve the overall trustworthiness of data. Having deployed OpenTitan onto a FPGA, we discuss our proof-of-concept findings regarding the integration into a (small) storage platform, including how external systems will interact with the root of trust.Key TakeawaysThere is an increasing need to improve the trustworthiness of data created at the Edge. RISC-V and Keystone Secure Enclaves can be used isolate sensitive functionality used to protect the integrity of data at time of capture. We can further improve data trustworthiness when adding an open source-based root of trust to the system. What we learned during our proof of concept when integrating an OpenTitan root of trust.",
    "url": "https://player.vimeo.com/video/488624842?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-08T23:30:00+00:00",
    "utcendtime": "2020-12-08T23:50:00+00:00",
    "title": "Data Trustworthiness at the Edge",
    "topic": "Security & Functional Safety",
    "kind": "Conference",
    "presenter": "Manuel Offenberg · Seagate Technology",
    "organization": null
  },
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc1NTUx",
    "description": "RISC-V is a branch-new open-source CPU architecture for IoT devices and an excellent platform for experimenting potential optimizations on JVM. The first step of our work is adding OpenJ9 support on RISC-V by leveraging existing Java technologies to support the ecosystem of OpenJ9 & RISC-V.Key TakeawaysUnderstand the main functionalities of OpenJ9 JDK to learn how it worksGet to know what features & functionalities are currently supported by OpenJ9 JDK on RISC-VA hands-on experience of cross-compiling a OpenJ9 JDK targeted for RISC-V (will demonstrate on the emulator or hardware if time permits)",
    "url": "https://player.vimeo.com/video/488627018?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-08T23:30:00+00:00",
    "utcendtime": "2020-12-08T23:50:00+00:00",
    "title": "OpenJ9 JDK on RISC-V",
    "topic": "Software & Tools",
    "kind": "Conference",
    "presenter": "Cheng Jin · IBM",
    "organization": null
  },
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc1NTUw",
    "description": "This session offers a quick introduction to tips, tricks, and tools for debugging RISC-V based embedded systems, including Instruction Trace, Code Profiling, Code Coverage, Runtime Behavior Analysis, RTOS-Awareness, and more. It also includes a glance at an increasingly popular IDE for developing code on MCUs and SoCs based on RISC-V, as well as an RTOS and embedded software stacks for RISC-V devices.Key TakeawaysHow to find out the execution time and frequency of functions in your codeHow to determine how much of a source line, block, or function has been executedHow to know which instructions have been executed before hitting a breakpointHow to analyze the run-time behavior of your RSIC-V based embedded systemA way to develop software for RISC-V based devices",
    "url": "https://player.vimeo.com/video/488625024?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-08T23:50:00+00:00",
    "utcendtime": "2020-12-09T00:00:00+00:00",
    "title": "Tech Talk with Segger: In a nutshell: Debugging RISC-V based Embedded Systems",
    "topic": "Tech Talk",
    "kind": "Tech Talk",
    "presenter": "Axel Wolf · Segger Microcontroller Systems",
    "organization": null
  },
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc1NTQ5",
    "description": "The SoC industry has seen the fast-growing and diversified demands for a wide range of RISC-V based products: from tiny low-power MCUs for consumer devices, to chips powering enterprise-grade products and datacenter servers; from one power-efficient core to a thousand GHz+ cores working cohesively. To serve the market, Andes has developed a rich portfolio of AndesCore processor IPs already used in the above scenarios. They include compact single-issue cores to feature-rich Linux-capable superscalar cores, cacheless single cores to cache-coherence multicores, and cores capable of processing floating-point and DSP data to those crunching a large volume of vector data. Based on the solid foundation, Andes continues to enrich our product offerings for higher performance efficiency as well as more flexible configurations.In this talk, we will first give an overview of Andes existing V5 RISC-V processor lineup and present examples of how V5 processors are used in SoC. Then, we will introduce V5 IPs newly added to Andes processor portfolio, the associated software support and their performance data. We will provide an update of Andes Custom Extension™ (ACE) and show how it can further accelerate control and data paths in applications. We will conclude our talk with a summary.Key TakeawaysGet to know the latest offerings of RISC-V processor IPsGet to know how P-extension and V-extension speed up applicationsGet to know the solutions for control path and data path processing",
    "url": "https://player.vimeo.com/video/488625072?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-09T00:00:00+00:00",
    "utcendtime": "2020-12-09T00:20:00+00:00",
    "title": "Andes RISC-V Processor IP Solutions",
    "topic": "Hardware Cores/SoCs",
    "kind": "Conference",
    "presenter": "Charlie Su · Andes Technology Corporation",
    "organization": null
  },
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc1NTQ4",
    "description": "From 2018, the spectre security hole has been recognized as one of the most severe issues in computer architecture. It exploits the speculative execution mechanisms of modern high-performance processors. By reading the side-effects of the cache, the attacker could recover the secret information from the memory which being processed by an error-free program.Researches proving that this kind of side-channel attack successfully worked on out-of-order processors. Accordingly, it is now continuing to experiment on a heterogeneous multi-core processor. This hybrid processor would combine and enhance the distinct advantages of the Out-of-Order and In-Order processors. Therefore, it becomes a relevant target for this security's scenario.With the various accessible products of RISC-V ecosystems, there are many open and non-restrictive licenses processor's architectures. Researchers, designers are given chances to propose, implement, test and evaluate any attack schemes on the RISC-V processors.This work shows the study and implementation of the side-channel attack via cache in a hybrid multi-core RISC-V processor. The processor is constructed by RISC-V Berkeley Out-of-Order Machine (BOOM) and RISC-V In-order processor (Rocket) . The attack would also be executed on physical FPGA VC707 and ZC706.Authors: Anh-Tien Le, Ba-Anh Dao, Ckristian Duran, Trong-Thuc Hoang, Akira Tsukamoto, Kuniyasu Suzaki and Cong-Kha PhamKey TakeawaysAttendees will gain general knowledge about side channel attack via cache.Attendees could learn specific examples of how to implement the spectre attack scenario on RISC-V processor.Attendees could see the concrete results of the attack on the experiment to gain the awareness of the side-channel attack.",
    "url": "https://player.vimeo.com/video/488625210?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-09T00:00:00+00:00",
    "utcendtime": "2020-12-09T00:20:00+00:00",
    "title": "Spectre on Hybrid multi-core RISC-V",
    "topic": "Security & Functional Safety",
    "kind": "Conference",
    "presenter": "Anh Tien Le · VLSILAB UEC",
    "organization": null
  },
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc1NTQ3",
    "description": "RISCV provides a tremendous opportunity to innovate in the post-Moore era. Several applications domains such as motor control, industrial protocols, DNNs, and signal processing benefit from instruction set specialization. As the role of architectural specialization becomes central to achieving higher energy efficiency, we present a new tool - called rvnewop - that accelerates the process of identifying and encoding custom instructions over the RISCV ISA baseline.RISCV ISA baseline starts out with a small set of about 40 instructions focused on integer arithmetic. Several standard extensions such as F (floating point), D (double precision), Q (quad precision), V (vectors), M (multiplication-division) and so on offer specialized capabilities that may be incorporated over the baseline, based on application domain requirements. Our tool - rvnewop - builds on top of these standard extensions. Using traces of execution of programs drawn from an application domain, rvnewop recommends new RISC instructions, and outputs their instruction encodings.To provide a usable tool framework, rvnewop automatically updates the GNU assembler, and the Spike simulator with these new encodings. Further, it also automatically creates an assembly version of input programs leveraging the new instructions. This enables architects to rapidly explore ISA specializations without being constrained by the lack of tool support. We will demonstrate these capabilities of the tool with a live demo.rvnewop is a tool under active development. While the current version incorporates data flow analysis over basic blocks, there are opportunities to perform analysis at a a larger program-scope in order to identify additional specializations.Key TakeawaysSpecialization / Customization opportunity with RISCVOpen-source Python framework to accelerate customization experimentsAutomatic tool chain updates to GNU assembler and SpikeExtensible framework -- allowing developers to perform additional program analysis or to link to other tools (simulator, codegen or design generation)",
    "url": "https://player.vimeo.com/video/488625274?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-09T00:00:00+00:00",
    "utcendtime": "2020-12-09T00:20:00+00:00",
    "title": "rvnewop: A RISCV New Instruction Recommender System",
    "topic": "Software & Tools",
    "kind": "Conference",
    "presenter": "Nagendra Gulur · University of North Texas/Texas Instruments",
    "organization": null
  },
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc1NTQ2",
    "description": "The emerging applications like AI, AR/VR, and computer vision require huge computation power and high-speed processing of large volumes of data. Many programmers accelerate these applications by OpenCL, a well-known parallel programming framework for heterogeneous platforms. For now, supporting OpenCL for RISC-V has not been addressed. In this talk, the basic concept of OpenCL will be introduced first. Then, the OpenCL extension for programming heterogeneous multi-cores with RVV cores will be presented. Finally, our OpenCL framework design for RISC-V and current status will be described. Key Takeaways Understand OpenCL Basic features Understand how to program multiple RVV cores by OpenCL Status about OpenCL for RISC-V ",
    "url": "https://player.vimeo.com/video/488625099?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-09T00:20:00+00:00",
    "utcendtime": "2020-12-09T00:30:00+00:00",
    "title": "Tech Talk with Andes: OpenCL for RISC-V",
    "topic": "Tech Talk",
    "kind": "Tech Talk",
    "presenter": "Shao-Chung Wang · Andes Technology",
    "organization": null
  },
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc1NTQz",
    "description": "OmniXtend continues to evolve as an open cache-coherent protocol ready to be deployed in real world applications. The question is how to provide the necessary support for OmniXtend to build a scalable system with thousands of nodes. Designing, verifying, and deploying of these scale-out systems in hardware is time consuming. We present a two-fold approach to build and accelerate the development of OmniXtend scale-out systems.  (i) We propose an initialization and configuration protocol defining a simple yet race-free approach to setting up multiple OmniXtend nodes during boot. This configuration protocol enables switching the system between two models: a single instance of an operating system over several nodes with Non-Uniform memory access (NUMA) or independent instances of an operating system on different nodes sharing memory.  (ii) We also provide a software simulation/emulation framework which implements the OmniXtend protocol and an Omnixtend system emulation using Qemu. The simulation framework helps to expedite the debugging and verification of the protocol while a full system emulation allows deploying OmniXtend compute nodes in software alongside the hardware, paving the way for OmniXtend to be the ubiquitous choice for building large scalable cache-coherent systems. Key Takeaways: OmniXtend, Cache coherence, Qemu emulation, Omnixtend Protocol Simulation",
    "url": "https://player.vimeo.com/video/488625391?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-09T00:30:00+00:00",
    "utcendtime": "2020-12-09T00:50:00+00:00",
    "title": "Building Cache-coherent Scaleout Systems with Omnixtend",
    "topic": "System Architectures",
    "kind": "Conference",
    "presenter": "Tu Dang · Western Digital",
    "organization": null
  },
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc1NTQx",
    "description": "For SoC designers adopting RISC-V, the prospects of tackling the processor DV tasks may be a new challenge. The established SoC flows have a couple of standard assumptions – test benches written for UVM SystemVerilog flows and known good processor IP from a mainstream supplier. Now with RISC-V, processor IP cores can be from a variety of sources, including commercial, open source and internally developed. In addition, options to extend or modify a processor make the processor DV task something for all adopters will need to consider.The RISC-V compliance suite is an essential starting point for any test plan, yet without a coverage and analysis strategy the flexibility of RISC-V can appear to be a complex undertaking. A key part of any test plan is the metrics used to define the milestones of progress and a detailed approach to analysis and resolution is key. Identification of an issue is useful, but getting insights into the behaviors and underlying issues are essential for the timely resolution. Early detection and analysis can avoid the costs and delays of a late stage discovery, as RISC-V custom extensions support multi-core communications the IP core and SoC verification stages are overlapping, especially in the case of many core arrays for AI and Machine Learning applications. Based on working with some popular open source cores this talk highlights the experiences of working with flows, test benches and methodologies with SoC DV teams exploring the full flexibility of RISC-V.Key TakeawaysVerification of a complex multi-state processor requires a complete DV test planLeveraging current DV flows and SystemVerilog methods lowers the barriers for SoC teams in adopting RISC-VThe ecosystem of RISC-V is interdependent with the success of the silicon devices, compliance and quality helps the adoption of RISC-V across all markets ",
    "url": "https://player.vimeo.com/video/488624993?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-09T00:30:00+00:00",
    "utcendtime": "2020-12-09T00:50:00+00:00",
    "title": "Getting started with RISC-V Processor Verification",
    "topic": "Verification",
    "kind": "Conference",
    "presenter": "Lee Moore · Imperas",
    "organization": null
  },
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc1NTQ1",
    "description": "In this talk, we will give an overview of OpenHW’s CORE-V open-source embedded MCU SoC. The platform is built around our CORE-V CV32E40P, a four-stage, in-order, embedded-class core with custom instruction set extension for DSP centric applications. A rich set of peripherals such as QSPI, camera interface, I2C, JTAG, and GPIOs make it the ideal candidate for any embedded SoC project. Furthermore, the CORE-V MCU SoC comes with an FPGA prototyping flow for the widely used Digilent Genesys II board and a rich set of software development tools and toolchain support.We will manufacture and make available our CORE-V MCU in Globalfoundries 22FDX together with an embedded FPGA from Quicklogic for custom logic such as accelerators.",
    "url": "https://player.vimeo.com/video/488624950?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-09T00:30:00+00:00",
    "utcendtime": "2020-12-09T00:50:00+00:00",
    "title": "CORE-V MCU SoC, Open Source, 22nm Embedded MCU with eFPGA",
    "topic": "Hardware Cores/SoCs",
    "kind": "Conference",
    "presenter": "Florian Zaruba · OpenHW Group",
    "organization": null
  },
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc1NTQ0",
    "description": "There is already no shortage of boot loaders for Linux, but Linux Kernel based bootloading via kexec has become popular as it provides the following distinct advantages:• Reuse kernel drivers, • Provides userspace, simplifying development, • Platform independence, and • Well tested.Boot loaders like GRUB provide several advanced features but they need to replicate functionalities similar to OS, which creates an ever increasing maintenance burden.Kexec lets you boot your Linux kernel into another kernel without going through the hardware reset and re-initialization performed by system BIOS/firmware:- Improves boot reliability by replacing lightly-tested firmware drivers with hardened Linux drivers.- Hardware reset and reinitialization performed by firmware takes minutes, being able to skip it reduces downtime.- Proven approach for several years – many kexec based bootloaders are already available [1][1]. linuxboot: https://www.linuxboot.org,petitboot: https://github.com/open-power/petitbootKexec based bootloaders on RISC-V are in early stabilization state, but these can provide interesting use-cases on RISC-V such as booting signed kernels from a given primary kernel. I am working on a Kexec based bootloader implementation on RISC-V qemu and will discuss my experiences with the same.However note that there is scope for improvement [see 2] - several Linux drivers don't yet implement .shutdown() callback, which means that kexec boot'ed kernel may panic. Let's discuss these to-dos needed to improve the kexec based bootloaders.[2]. 10a663a1b151 (\"ata: ahci: Add shutdown to freeze hardware resources of ahci\"), 428c491332bc (\"net: ena: Add PCI shutdown handler to allow safe kexec\").Key TakeawaysLearn about kexec based fast rebooting.Learn about kexec usage on RISC-V qemu platforms.Learn about potential TO-DOs, which need help in implementing for upstream.",
    "url": "https://player.vimeo.com/video/488625253?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-09T00:30:00+00:00",
    "utcendtime": "2020-12-09T00:50:00+00:00",
    "title": "kexec based bootloaders on RISC-V: Use-cases and Advantages",
    "topic": "Software & Tools",
    "kind": "Conference",
    "presenter": "Bhupesh Sharma · Red Hat",
    "organization": null
  },
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc1NTQy",
    "description": "RISC-V ISA was designed to be configurable and extensible. Like the SweRV family of cores from Western Digital, open-source RISC-V cores offer a strong starting point for researchers and companies looking to build custom CPUs. Verification of these custom CPUs requires test generators, instruction set simulators (ISS), and RTL simulators -- all of which are available as open-source tools. What is needed is a unified environment to jump-start the verification work with minimal effort.   Lampro Mellon is a global SoC design and verification services company, working on verification of cutting-edge RISC-V processors, and development of BSP and Linux drivers for RISC-V and ARM-based systems. Within the domain of SoC design and verification, LM has created LM RISC-V DV that combines RISCV-DV test generator, Spike ISS, and SweRV core into a seamless end-to-end flow -- from random assembly test generation and RTL compilation to post-simulation comparison. This environment accelerates the design and verification of cores, which results in reduced design cycle times and cost. And the great thing is; LM RISC-V DV is also open-source.    Session Take-aways   A major obstacle to reuse of open-source IPs and tools is the lack of an integrated environment.    LM RISC-V DV = SweRV  +  RISCV-DV Instruction Generator  +  Spike ISS    LM RISC-V DV can be used to reduce design cycle time for RISC-V processor cores and is open-source  ",
    "url": "https://player.vimeo.com/video/488625005?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-09T00:50:00+00:00",
    "utcendtime": "2020-12-09T01:00:00+00:00",
    "title": "Tech Talk with Lampro Mellon: An Open-Source Solution for Accelerating Verification of RISC-V Processors",
    "topic": "Tech Talk",
    "kind": "Tech Talk",
    "presenter": "Haroon Shafique · Lampro Mellon",
    "organization": null
  },
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc1NTQw",
    "description": "Join us for this live-in-zoom session to meet the speakers and ask follow up questions from today's presentations.  ",
    "url": "https://player.vimeo.com/video/488625005?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-09T01:00:00+00:00",
    "utcendtime": "2020-12-09T01:30:00+00:00",
    "title": "LIVE Q&A Forum with Speakers: Room A",
    "topic": "Meet the Speakers: Room A",
    "kind": "Meet the Speakers",
    "presenter": "Krste Asanovic · UC Berkeley | SiFive",
    "organization": null
  },
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc1NTM5",
    "description": "Join us for this live-in-zoom session to meet the speakers and ask follow up questions from today's presentations.  ",
    "url": "https://player.vimeo.com/video/488685005?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-09T01:00:00+00:00",
    "utcendtime": "2020-12-09T01:30:00+00:00",
    "title": "LIVE Q&A Forum with Speakers: Room B",
    "topic": "Meet the Speakers: Room B",
    "kind": "Meet the Speakers",
    "presenter": "Florian Zaruba · OpenHW Group",
    "organization": null
  },
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjg0OTI3",
    "description": "Announcing this year's award recipients recognizing their contributions of excellence to the innovation and continued growth of RISC-V ISA and ecosystem.   2020 Board of Directors Technical Leadership Award   RISC-V Innovation Founders   RISC-V Top Technical Contributors in 2020  ",
    "url": "https://player.vimeo.com/video/488685005?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-09T16:50:00+00:00",
    "utcendtime": "2020-12-09T17:00:00+00:00",
    "title": "RISC-V International Awards 2020",
    "topic": null,
    "kind": "Keynote",
    "presenter": "Krste Asanovic · UC Berkeley | SiFive",
    "organization": null
  },
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc1NTM4",
    "description": "RISC-V adoption continues to grow tremendously, reaching many new application domains. By combining a modular design philosophy with the power of a growing worldwide community of expert contributors, the RISC-V project addresses the challenge of expanding and improving the architecture to support new domains without undermining the architectural foundations that support a vibrant software ecosystem. In this talk, I'll take a look at how RISC-V has evolved over the last ten years, and project how the design will evolve to solve computing needs for the next decade.",
    "url": "https://player.vimeo.com/video/488684680?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-09T16:55:00+00:00",
    "utcendtime": "2020-12-09T17:15:00+00:00",
    "title": "RISC-V: The Next Ten Years",
    "topic": "Keynote Program",
    "kind": "Keynote",
    "presenter": "Krste Asanovic · UC Berkeley | SiFive",
    "organization": null
  },
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc1NTM3",
    "description": "The CORE-V family is an OpenHW Group project to develop, deploy, execute pre-silicon functional verification and SoC based evaluation kits of the CORE-V family of open-source RISC-V cores. Written in SystemVerilog, the CORE-V open-source IP matches the quality of IP offered by established commercial providers and is verified with state-of-the-art, auditable flows.The CORE-V cores are verified using CORE-V-VERIF a silicon-proven, industrial-grade functional verification platform. CORE-V-VERIF has been used to execute a complete verification cycle of the CORE-V CV32E40P core and is currently being used to execute verification of the CV32A6 and CV64A6 cores. CORE-V-VERIF leverage verification components developed by the RISC-V community and will be continuously maintained and enhanced to integrate the latest best-practices and technology for the verification of future CORE-V cores such that CORE-V cores can be used in high-volume production SoCs.",
    "url": "https://player.vimeo.com/video/488683984?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-09T17:15:00+00:00",
    "utcendtime": "2020-12-09T17:30:00+00:00",
    "title": "CORE-V: Industrial Grade Open Source RISC-V Cores",
    "topic": "Keynote Program",
    "kind": "Keynote",
    "presenter": "Rick O'Connor · OpenHW Group",
    "organization": null
  },
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc1NTM2",
    "description": "RISC-V offers all SoC developers the opportunity to optimize a processor design, either as a new implementation or modification of an open source or commercial core. How will the SoC design verification (DV) teams address these new freedoms on the design side without compromising the project schedule or quality? Can processor DV become mainstream and routine for all SoC teams?This panel consists of representatives from across the semiconductor and processor industry with experience with RISC-V plus other processor architectures and the latest trends in SoC design verification (DV) methodology.The historical assumption often quoted is that verification represents 60-80% or more of the SoC project effort in terms of both cost and time, this was based on mature mainstream processor IP cores. The processor IP business model was based on the leveraged of one-size-fits all over many projects to offset the upfront investment. If the innovation with RISC-V increases the verification work on each design does this affect the bandwidth across the industry to support this shift in the verification responsibility?",
    "url": "https://player.vimeo.com/video/488684441?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-09T17:30:00+00:00",
    "utcendtime": "2020-12-09T18:00:00+00:00",
    "title": "Is RISC-V Verification Ecosystem Ready for the Coming Innovation Tsunami?",
    "topic": "Keynote Program",
    "kind": "Keynote",
    "presenter": "Ann Steffora Mutschler · Semiconductor Engineering",
    "organization": null
  },
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc1NTM1",
    "description": null,
    "url": "https://player.vimeo.com/video/488684067?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-09T18:00:00+00:00",
    "utcendtime": "2020-12-09T18:30:00+00:00",
    "title": "Fireside Chat",
    "topic": "Keynote Program",
    "kind": "Keynote",
    "presenter": "Nitin Dahad · EE Times and Embedded.com",
    "organization": null
  },
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc1NTM0",
    "description": "Join us for this live-in-zoom session to meet the speakers and ask follow up questions from today's Keyntoe presentations.",
    "url": "https://player.vimeo.com/video/488683400?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-09T18:30:00+00:00",
    "utcendtime": "2020-12-09T19:00:00+00:00",
    "title": "LIVE Q&A Forum with the Keynote Speakers",
    "topic": "Meet the Speakers: Room A",
    "kind": "Meet the Speakers",
    "presenter": "Krste Asanovic · UC Berkeley | SiFive",
    "organization": null
  },
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc1NTMz",
    "description": "TrustZone has been a popular security architecture on Arm cores that most people migrating to RISC-V are considering as a must-have requirement. This goes beyond just the CPU core since a number of external TrustZone modules are used to secure memories and peripherals. SiFive WorldGuard provides an open hardware enforced isolation architecture with fine grained protection on DMA controllers, caches, interconnect, memories and peripherals. SiFive WorldGuard goes beyond what Arm TrustZone offers since it supports a virtually unlimited number of \"Worlds\" or containers.  This advanced flexibility gives architects an option to maintain TrustZone compatibility while migrating to RISC-V. This is a game changer when upgrading an Arm core to a RISC-V core while maintaining system-level compatibility with TrustZone-enabled IP. In this talk, we present details of how to integrate a SiFive WorldGuard-enabled RISC-V IP subsystem into an Arm TrustZone socket.Key TakeawaysUpgrading from Arm core to RISC-VTrustZone compatibilitySiFive WorldGuard hardware enforced isolation architecture",
    "url": "https://player.vimeo.com/video/488683400?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-09T19:00:00+00:00",
    "utcendtime": "2020-12-09T19:20:00+00:00",
    "title": "Migrating to RISC-V while maintaining TrustZone Compatibility",
    "topic": "Security & Functional Safety",
    "kind": "Conference",
    "presenter": "Dany Nativel · SiFive",
    "organization": null
  },
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc1NTMy",
    "description": "RISC-V is gaining traction for AI and Machine Learning applications as system designers migrate cloud-based algorithms to dedicated hardware. RISC-V offers the options to fine tune the processor features and configure vector engines to accelerate the key functions. In many core arrays the processors can be a mix of capabilities for a true heterogeneous solution. The RISC-V support of custom instruction and extension can be used for both new functions and also lightweight inter-processor communications across the arrays of processors.Using virtual platforms allows system designers to explore various configurations and arrangements of processors and test these with the full application workloads and real-world datasets. Given the broad range of target markets looking at AI solutions, RISC-V is uniquely positioned to scale across all the compute requirements.As the front end of the design exploration moves towards the detailed design phase the reference model approach allows the hardware developers to use a functional model as part of the design specification and help develop the test bench with behavioral models. Developing software before silicon is useful for the internal project teams, but in many markets the option to provide early evaluation platforms to prospects and partners is a key way to develop support and interest for these new devices.Based on experience with advanced AI designs this talk with highlight the virtual platforms role in these new market segments with multi-processor design techniques illustrated with examples of current design projects. Key TakeawaysVirtual platforms support early software development – full applications workloads and real-world datasets, not just simple benchmarksArchitectural exploration with RISC-V reference models also supports behavioral models in test benches for design verificationRISC-V offers flexibility in performance and custom instructions, for multi-core arrays finding the optional configuration needs iterations at the speed of software",
    "url": "https://player.vimeo.com/video/488684232?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-09T19:00:00+00:00",
    "utcendtime": "2020-12-09T19:20:00+00:00",
    "title": "RISC-V & SoC Architectural Exploration for AI and ML accelerators",
    "topic": "System Architectures",
    "kind": "Conference",
    "presenter": "Simon Davidmann · Imperas Software Ltd",
    "organization": null
  },
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc1NTMx",
    "description": "To address the very important problem of RISC-V compliance testing, an official hand-written compliance test-suite is being actively developed. While it provides good results on the positive testing side (the implemented instructions work as expected), it requires significant manual effort and neglects negative testing (consider illegal instructions to also ensure that no additional/unexpected behavior is accidentally added). This leaves a large gap in compliance testing. In this talk we present a fuzzing-based test-suite generation approach to complement the official compliance test-suite and close this gap. We leverage advanced coverage-guided fuzzing techniques in combination with a custom coverage metric and fuzzing mutator to boost the efficiency of our approach. We found new bugs in several RISC-V simulators including the official RISC-V reference simulator for compliance testing.Key TakeawaysOverview on RISC-V Compliance TestingFuzzing Concept and Application for Testcase GenerationAdvanced Techniques to Boost the Fuzzing Efficiency tailored for RISC-V ",
    "url": "https://player.vimeo.com/video/488681663?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-09T19:00:00+00:00",
    "utcendtime": "2020-12-09T19:20:00+00:00",
    "title": "Closing the RISC-V Compliance Gap via Fuzzing",
    "topic": "Verification",
    "kind": "Conference",
    "presenter": "Vladimir Herdt · University of Bremen / DFKI GmbH",
    "organization": null
  },
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc1NTMw",
    "description": "Why do the providers of the fault-tolerant LEON/SPARC architecture believe that RISC-V will be dominating space in the future? Session Takeaways RISC-V story is very much the LEON story - when seen from Earth orbit",
    "url": "https://player.vimeo.com/video/488683082?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-09T19:20:00+00:00",
    "utcendtime": "2020-12-09T19:30:00+00:00",
    "title": "Tech Talk with Cobham Gaisler: The Case for RISC-V in Space Applications",
    "topic": "Tech Talk",
    "kind": "Tech Talk",
    "presenter": "Jan Andersson · Cobham Gaisler",
    "organization": null
  },
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc1NTI5",
    "description": "The security of computer systems relies on the strict isolation of applications. Memory protection is the established isolation mechanism, and is well supported by modern ISAs. However, leakage through the timing of events, called timing channels, has long been known as a way to bypass this isolation. The recent Spectre attack has demonstrated that microarchitectural timing channels, where the leakage exploits hardware state hidden by the ISA, are a major security concern. We demonstrate that microarchitectural state-induced leakage can be significant even on a simple application-class 64-bit RISC-V core (ARIANE from the PULP project), measuring up to 3.7 bits per preemption (order of kilobits per second). In this presentation, we will introduce the concept of time protection as a systematic prevention mechanism. We show how the RISC-V ISA can be easily extended to support time protection, and demonstrate  based on an actual implementation  that it is highly effective in preventing leakage while imposing negligible hardware and run-time overhead. The exact form of this ISA extension is presently being discussed in the RISC-V Privileged Spec Technical Committee.Key TakeawaysMicroarchitectural timing channels are a real security threat and exist on current RISC-V systemsTime protection can be the solution: making history-dependent state architecturally visible and controllable by the OSThe implementation of time protection is mostly straightforward and comes at negligible cost This is an opportunity for RISC-V to proactively solve a critical and fundamental security problem",
    "url": "https://player.vimeo.com/video/488682315?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-09T19:30:00+00:00",
    "utcendtime": "2020-12-09T19:50:00+00:00",
    "title": "Time Protection: Preventing Microarchitectural Timing Channels on RISC-V",
    "topic": "Security & Functional Safety",
    "kind": "Conference",
    "presenter": "Nils Wistoff · ETH Zurich",
    "organization": null
  },
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc1NTI4",
    "description": "We introduce the category of Cluster CPUs. These are general purpose CPUs that run existing RISC-V binaries, but are micro-architected for applications that run on clusters of servers. They take advantage of the fact that cluster ready applications have many active software threads available, and leverage that to gain similar performance to Out of Order CPUs, but at an order of magnitude less power, and less silicon area.The result is 12 times more performance per dollar (of total cost of ownership) versus existing rackmount servers.Intensivate's IntenScale card is a PCIe card designed to hold 21 Cluster CPU chips, each paired to its own 32GB of RAM. It fits existing PCIe slots designed to hold GPUs, and sports 4x 100G connections direct to the Top of Rack switch. In this topology, each chip on the IntenScale card is viewed as an independent server (diskless, that boots over the network) with its own IP address, that boots the standard RISC-V operating systems. By adding such a card to a Host and wiring it to the Top of Rack switch, the network gains 21 more servers, each with 16 cores (which means 256 hardware threads), and 32GB of main memory.The efficiency of such a CPU on the already large and growing class of applications that run on clusters will cause Cluster CPUs to become a new category of standard computation hardware in the data center, sitting alongside GPUs and AI accelerators. RISC-V enables this revolution. Key TakeawaysCluster CPUs are a new category of CPU that increase the computation per dollar by 12 (twelve) times, on existing software (that runs on clusters of servers).Cluster CPUs will become a new form of standard equipment in the data center.The RISC-V eco system has reduced the cost to deliver this silicon by a factor of 10.As a result of the cost and effort reduction, a RISC-V processor will be the first to market in this category, an indication that the stage is set for RISC-V to play a major role in post-Moore's law silicon innovation.",
    "url": "https://player.vimeo.com/video/488681853?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-09T19:30:00+00:00",
    "utcendtime": "2020-12-09T19:50:00+00:00",
    "title": "Cluster CPU -- New Micro-architecture for Cluster Computing",
    "topic": "System Architectures",
    "kind": "Conference",
    "presenter": "Sean Halle · Intensivate",
    "organization": null
  },
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc1NTI3",
    "description": "In this talk, we describe a new coverage driven solution for RISC-V formal verification. With our solution, the user specifies scenarios of interest in a spreadsheet, and our app-based solution produces evidence of those scenarios by providing visual feedback in the form of waveforms if those scenarios are possible. If a scenario is not possible, we show that it is not by showing that they are unreachable regardless of the input stimulus. Additionally, we \"prove\" that those scenarios specified by the user will \"always work correctly\"; not only \"can\" they happen, but they \"must always\" happen. We produce these results without requiring the user to:1. Write a single line of test case2. Write any input sequence3. Write any checkers or scoreboards4. Write any constraints5. Write any line of verification codeOur GUI based solution produces:1. Formal proofs that all instructions in the ISA have been implemented correctly in the RISC-V design regardless of any input stimulus.2. Cover properties coded per instruction provide visual feedback to the end-user.3. Structural coverage metrics reported from the formal verification tool provide reachability analysis.4. Our ISA coverage analyzer provides proofs of correctness for each row in the spreadsheet showing without doubt that scenarios of interest can always work correctly, and also visual feedback is obtained in the form of waveforms when the scenarios are reachable.5. Unreachable scenarios are reported that fail to satisfy the scenario of interest. Failed assertions provide waveforms explaining cause of failure. Key TakeawaysUnderstand \"how to\" use formal verification to find corner-case bugs in seconds, and obtain \"proofs\" of bug absence.Understand \"what it takes to get started\" with formal verification for RISC-V processors.Understand \"how by writing no tests, and no input stimulus\" they can obtain mathematical proof that the RISC-V core works against the published ISA.Understand \"how to find security flaws\" in a RISC-V core using formal verification automatically.Understand that a user can \"use any formal verification tool\" with our solution to get the best of quality and price trade-off.",
    "url": "https://player.vimeo.com/video/488682879?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-09T19:30:00+00:00",
    "utcendtime": "2020-12-09T19:50:00+00:00",
    "title": "Coverage-driven Formal Verification for RISC-V ISA Compliance",
    "topic": "Verification",
    "kind": "Conference",
    "presenter": "Ashish Darbari · AXIOMISE",
    "organization": null
  },
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc1NTI2",
    "description": null,
    "url": "https://player.vimeo.com/video/488684375?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-09T19:50:00+00:00",
    "utcendtime": "2020-12-09T20:00:00+00:00",
    "title": "Tech Talk with Seagate: Data on the Move: A RISC-V Opportunity",
    "topic": "Tech Talk",
    "kind": "Tech Talk",
    "presenter": "Bruno Masson · Seagate Technology",
    "organization": null
  },
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc1NTIz",
    "description": "RISC-V Vector Extension is an ISA extension to exploit vector processing. By providing great scalability and performance to address diversified requirements, the Vector Extension not only expands the capabilities of RISC-V processors, but is also accompanied with unavoidable design complexity and verification challenges with enormous instruction variations.In this talk, we will first introduce the framework and the latest status of RISCV-DV, an open source verification platform for random RISC-V instruction generation. Then, we will review common verification issues of vector extension and provide a solution using our recent vector extension contribution to RISCV-DV. We will present our constrained random based verification methodology to ensure the design quality by integrating RISCV-DV in our environment and use the first commercial vector processor IP, Andes NX27V, as a case study. Key TakeawaysUnderstanding the verification challenges of RISC-V vector extensionThe latest status of RISCV-DV and its vector extension What you need to do to add new extension into RISCV-DVArchitectural specific constrained random verification methodology",
    "url": "https://player.vimeo.com/video/488626958?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-09T20:00:00+00:00",
    "utcendtime": "2020-12-09T20:20:00+00:00",
    "title": "Enhancing Verification Coverage for RISC-V Vector Extension Using RISCV-DV",
    "topic": "Verification",
    "kind": "Conference",
    "presenter": "DingKai Huang · Andes Technology",
    "organization": null
  },
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc1NTI1",
    "description": "Building masked software implementations in a secure manner is a challenging task with many pitfalls. Several publications discuss these challenges, which typically boil down to the fact that masking schemes make certain assumptions on the underlying CPU hardware, like independence of leakage, that are not satisfied in practice. In order to remove such side-channel leakage, the typical approach in practice is to iteratively fix and empirically verify the security of the implementation. This is an error-prone and time-consuming process.We overcome the current situation and present the first approach for co-design and co-verification of masked software implementations on CPUs. First, we present Coco, a tool  that allows us to provide security proofs at the gate-level for the execution of a masked software implementation on a concrete CPU. Using Coco, we analyze the popular 32-bit RISC-V Ibex core, identify all design aspects that violate the security of our tested masked software implementations and perform corrections, mostly in hardware. The resulting secured Ibex core has an area overhead around 10%, the runtime of software on this core is largely unaffected, and the formal verification with Coco of an, e.g., first-order masked Keccak S-box running on the secured Ibex core takes around 156 seconds.Key TakeawaysHow can we verify that the execution of masked software implementations written is leakage-free on a given CPU?How can we identify which which parts of CPUs are the main sources of leakage?What can we do to eliminate these leakage sources?   All these questions are discussed using the RISC-V Ibex core and assembly programs written in RISC-V assembly.",
    "url": "https://player.vimeo.com/video/488681573?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-09T20:00:00+00:00",
    "utcendtime": "2020-12-09T20:20:00+00:00",
    "title": "Coco: Co-Design and Co-Verification of Masked Software Implementations on CPUs",
    "topic": "Security & Functional Safety",
    "kind": "Conference",
    "presenter": "Barbara Gigerl · Technical University of Graz",
    "organization": null
  },
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc1NTI0",
    "description": "In this session, you will learn how the RISC-V ecosystem is helping in the cutting-edge research to build the advanced quantum testbed. Current state-of-the-art quantum computers are typically controlled by an ad-hoc combination of classical control electronics. These classical control electronics are highly diversified and see little technology reuse across different system implementations. In all cases, the control electronics must meet stringent real-time and sensitivity constraints that will become increasingly stringent with the growing size of quantum chips. Early experiments all indicate that long-term success of quantum computing hinges on developing better qubit designs combined with a more effective classical control hardware pipeline that is scalable, extensible, and able to provide real-time guarantees. Berkeley Lab researchers address these limitations by developing a custom and open FPGA control system architecture. This talk will describe the quantum system architecture with a RISC-V processor extended to support special quantum operations and analog backend communication. The talk will be accompanied by an FPGA prototype demo implemented using the SiFive Freedom platform.  Key Takeaways The attendees will learn about the cutting-edge technologies that are developed at the Berkeley Lab using RISC-V ecosystem. ",
    "url": "https://player.vimeo.com/video/488681950?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-09T20:00:00+00:00",
    "utcendtime": "2020-12-09T20:20:00+00:00",
    "title": "Building an Open Control Stack for Quantum Computers using RISC-V Ecosystem",
    "topic": "System Architectures",
    "kind": "Conference",
    "presenter": "Anastasiia Butko · LBNL",
    "organization": null
  },
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc1NTE5",
    "description": "One of hurdles for achieving market adoption of AI processors is the programming model and tools for software developers. There are now hundreds of neural network processors achieving great performance, demonstrated with today's benchmarks, but when it comes to integration and usability, the gap can be huge.RISC-V is based on openness; ISA specification, industry contributions for systems and an embraced ecosystem. This must extend to an open software platform, providing software developers an easy way to harness the familiar benefits already available on CPUs and GPUs.Today, system-on-chip manufacturers are building specialist accelerator processors using the RISC-V architecture, taking advantage of the Vectorized extensions to provide exceptional performance that matches compute performance mostly seen on GPUs today. The availability of a familiar and well defined programming model is an absolute requirement if expecting to successfully bring these new processors to market.Just like The Khronos group brought the OpenGL open standard interface to developers 20 years ago combining the expertise of the whole industry, the same approach is happening for programmers of AI systems. The Khronos standards OpenCL and SYCL are already extensively adopted for compute systems, and are gaining momentum in many market segments, from HPC exascale systems to automotive ADAS.This presentation outlines the software developer needs, how OpenCL and SYCL provides the core infrastructure for the ecosystem of other standards, how they integrate onto a RISC-V SoC and outlines the benefits to software developers of a healthy ecosystem.Key Takeaways:A path from AI and C++ development onto RISC-V Vector processorsThe existing ecosystem around available thanks to SYCLUnderstand how SYCL provides a robust and well defined programming model for software developers",
    "url": "https://player.vimeo.com/video/488683012?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-09T20:00:00+00:00",
    "utcendtime": "2020-12-09T20:20:00+00:00",
    "title": "Enabling open programming models in RISC-V for AI and HPC",
    "topic": "Software & Tools",
    "kind": "Conference",
    "presenter": "Andrew Richards · Codeplay Software Ltd",
    "organization": null
  },
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc1NTIy",
    "description": "Overview of capabilities available to debug and trace heterogeneous SOC incorporating RISC-V and other processors Session Takeaways TRACE32 allows you to define the interaction between separate processors cores in a complex SOC",
    "url": "https://player.vimeo.com/video/488625241?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-09T20:20:00+00:00",
    "utcendtime": "2020-12-09T20:30:00+00:00",
    "title": "Tech Talk with Lauterbach: Debug and Trace of RISC-V based SOC",
    "topic": "Tech Talk",
    "kind": "Tech Talk",
    "presenter": "Dennis Griffith · Lauterbach",
    "organization": null
  },
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc2MzQz",
    "description": "New processor architectures require access to development environments to create and optimize software. The SiFive HiFive Unmatched board will enable professional developers to create RISC-V applications from bare-metal to Linux-based, including porting of existing applications. The FU740 combines a heterogeneous mix+match core complex with modern PC expansion capabilities and form factor with a suite of included tools to facilitate broad professional software development. ",
    "url": "https://player.vimeo.com/video/488684517?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-09T20:30:00+00:00",
    "utcendtime": "2020-12-09T20:50:00+00:00",
    "title": "Building a RISC-V Ecosystem",
    "topic": "Community Ecosystem",
    "kind": "Conference",
    "presenter": "Yunsup Lee · SiFive",
    "organization": null
  },
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc1NTIx",
    "description": " Join us for an introduction to the world’s first RISC-V® based System-on-Chip (SoC) FPGA. This multi-core RISC-V based SoC system delivers more functionality to the FPGA. An FPGA is like a blank canvas, which means you must develop your HDL design, generate and program the part, and test before you can start implementing your design.   In this presentation we will discuss:  Functionality of the application and monitor cores  How to develop with bare metal  How to develop an FPGA  By the end of this presentation, you should be well equipped to develop your next project with the PolarFire SoC.   ",
    "url": "https://player.vimeo.com/video/488683650?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-09T20:30:00+00:00",
    "utcendtime": "2020-12-09T20:50:00+00:00",
    "title": "Developing with PolarFire® SoC",
    "topic": "Hardware Cores/SoCs",
    "kind": "Conference",
    "presenter": "Hugh Breslin · Microchip",
    "organization": null
  },
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc1NTIw",
    "description": "This talk will focus on the award-winning past and on-going educational activities at the Polytechnic University of Catalonia (UPC), Barcelona, Spain and the Barcelona Supercomputing Center (BSC) in Computer Architecture for safety critical systems, which became possible thanks to the RISC-V initiative. Functional safety and security are two domains of paramount importance for current and future safety-critical systems, such as the ones used in transportation (automotive, avionics, space, railway), medical or control-systems. However, the trend in computer architecture education and practice has been traditionally focused only on performance. Moreover, despite the significant interest of safety-critical industries in RISC-V and the large market sectors they represent, the number of available cores with functional safety features is significantly under-represented compared to the sheer amount of RISC-V cores, especially the open-sourced ones. In the 2019 edition of the advanced graduate Processor Design course at the Polytechnic University of Catalonia (UPC), the students implemented and verified such features in several open-source RISC-V designs, gaining hands-on experience with these design principles. For this activity, Dr. Kosmidis was awarded the RISC-V Educator of the Year Award. This talk will provide the details of the developed and open sourced modifications of these RISC-V designs, as well as the new developments which will be completed in the fall semester of the 2020 edition of the course. If time permits, the synergies between this course and other entry level courses at UPC and the tape-out activities of the first educational RISC-V processor in Spain by BSC will be covered, too.  Key Takeaways For educators: -New educational opportunities which are made possible by the RISC-V initiative, as implemented at the Polytecnic University of Catalonia (UPC) and the Barcelona Supercomputing Center (BSC) For Designers/Architects/Task Groups: -Overview of important Safety and Security design principles which should be taken into account for the design of existing and future RISC-V designs For the general audience/community: -Description of the design modifications for the improvement of safety and security of several existing RISC-V processors implemented and open-sourced by my students ",
    "url": "https://player.vimeo.com/video/488682046?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-09T20:30:00+00:00",
    "utcendtime": "2020-12-09T20:50:00+00:00",
    "title": "Educating the Computer Architects of Tomorrow's Critical Systems with RISC-V",
    "topic": "Security & Functional Safety",
    "kind": "Conference",
    "presenter": "Leonidas Kosmidis · Barcelona Supercomputing Center (BSC) and Polytechnic University of Catalonia (UPC)",
    "organization": null
  },
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc1NTE4",
    "description": "As use cases for RISC-V instruction set architecture are migrating from IoT and embedded use case to high end datacenter and enterprise applications, need for cache-coherent sharing memory systems is increasing. We have recently proposed OmniXtend: a cache-coherency protocol architecture, that exports Tilelink cache-coherence messages on the top of L2 ethernet frames. This architecture allows heterogenous systems that use same TileLink cache-coherence protocol to share the memory in a coherent fashion. In this study, we report the results of four (4) RISC-V nodes, each running 4 independent RISC-V harts, connecting via commercial ethernet switch, and establishing ccNUMA (cache coherent non-uniform memory access) architecture. We report detailed study of local and non-local (i.e. going through ethernet switch) cache access latencies, and propose several software models for OmniXtend-backed architectures.",
    "url": "https://player.vimeo.com/video/488683263?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-09T20:30:00+00:00",
    "utcendtime": "2020-12-09T20:50:00+00:00",
    "title": "OmniXtend: Open Source Cache-coherence over Ethernet",
    "topic": "System Architectures",
    "kind": "Conference",
    "presenter": "Zvonimir Bandic · Western Digital | CHIPS Alliance",
    "organization": null
  },
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc1NTE3",
    "description": "Join us for this live-in-zoom session to meet the speakers and ask follow up questions from today's presentations.  ",
    "url": "https://player.vimeo.com/video/488683495?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-09T20:50:00+00:00",
    "utcendtime": "2020-12-09T21:30:00+00:00",
    "title": "LIVE Q&A Forum with Speakers: Room A",
    "topic": "Meet the Speakers: Room A",
    "kind": "Meet the Speakers",
    "presenter": "Nils Wistoff · ETH Zurich",
    "organization": null
  },
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc1NTE2",
    "description": "Join us for this live-in-zoom session to meet the speakers and ask follow up questions from today's presentations.  ",
    "url": "https://player.vimeo.com/video/488683495?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-09T20:50:00+00:00",
    "utcendtime": "2020-12-09T21:30:00+00:00",
    "title": "LIVE Q&A Forum with Speakers: Room B",
    "topic": "Meet the Speakers: Room B",
    "kind": "Meet the Speakers",
    "presenter": "Zvonimir Bandic · Western Digital | CHIPS Alliance",
    "organization": null
  },
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc1NTEz",
    "description": "OpenTitan is an open source silicon Root of Trust (RoT) project, that uses a RISC-V CPU as its main controller. OpenTitan uses the Ibex RISC-V core as it's MCU and attaches a range of different IP blocks, in including USB, I2C, HMAC and AES Crypto. Tock is an Embedded Operating System (OS) that isolates apps from each other and the kernel. Tock is written entirely in Rust and supports a range of different SoCs and boards based on RISC-V or ARM ISAs. This talk will discuss the process of porting Tock to OpenTitan. This talk will go into detail about how FIDO CTAP support was added to Tock on OpenTitan as an example of how the Tock ecosystem works. The talk will include a demo of using Tock and OpenTitan as a FIDO2 USB authenticator. Key Takeaways: What OpenTitan is What Tock is  What Tock apps are and how they are isolated The current mainline status of Tock on OpenTitan A deep dive into adding USB/CTAP support to Tock on OpenTitan",
    "url": "https://player.vimeo.com/video/488683495?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-09T21:30:00+00:00",
    "utcendtime": "2020-12-09T21:50:00+00:00",
    "title": "Porting Tock to OpenTitan",
    "topic": "Software & Tools",
    "kind": "Conference",
    "presenter": "Alistair Francis · Western Digital",
    "organization": null
  },
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc1NTE1",
    "description": "Modern cellular communications use the Orthogonal frequency-division multiple access (OFDMA) air interface. In such a system, data is transmitted in symbols which are grouped in slots. In 5G these slots can range from 0.25 and 0.125 ms. The scheduling of the traffic carried in these slots is done by the MAC layer. It schedules traffic to the network (uplink) as well from the network to the User (downlink).Efficient 5G base stations are being designed and deployed to handle not just many, many users supporting many 5G cells but even have support for several separate mobile operators. Each operator may require its own software.The physical layer (PHY) must process the data (both control and user) passed to it by the MAC to fill in the slots and symbols for transmission and reception. If the PHY fails to meet the strict timing constraints whole slots of data will be lost requiring recovery mechanisms.In this talk we present a heterogeneous SoC which implements a 5G NG small cell base station using clusters of RISCVs and dedicated DSPs. Each of the RISCVs will be running the Zephyr OS. The talk will also show how the strict timing constraints are continuously monitored non-intrusively and how embedded analytics provides useful insights into the behaviour of the base station. Key TakeawaysComplexities of 5G physical layer describedPicocom Technologies SoC explainedEmbedded analytics",
    "url": "https://player.vimeo.com/video/488625412?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-09T21:30:00+00:00",
    "utcendtime": "2020-12-09T21:50:00+00:00",
    "title": "RISC-V in 5G New Radio Small Cell Base Stations",
    "topic": "Hardware Cores/SoCs",
    "kind": "Conference",
    "presenter": "Gajinder Panesar · Mentor, A Siemens Business",
    "organization": null
  },
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc1NTE0",
    "description": "Developing secure IoT devices is challenging. These resource-constrained devices typically lack the hardware resources necessary for the trusted execution of the many complex 3rd party software components required for secure operations. Over time, established platform vendors have developed light-weight Trusted Execution Environments and relative embedded software stacks optimized for their smaller processors. However, none of these are available to RISC-V developers who are left alone figuring out how to shield trusted code from unverified 3rd party software libraries and how to safely combine these components into the single firmware image powering their commercial applications.In this presentation, Cesare Garlati and Sandro Pinto, renowned embedded security experts and long-time passionate supporters of RISC-V, will introduce the industry-first free and open secure IoT stack for RISC-V. The presentation covers all hardware and software components necessary to build state-of-the-art device, firmware, and cloud management service. These include RISC-V 32-bit SoC fpga, multi-zone Trusted Execution Environment, safety-critical RTOS, TCP/IP connectivity, TLS ECC cryptography, and MQTT client and broker providing telemetry and OTA applications deployment and firmware updates. All components are built on free and open standards, distributed under permissive licensing, and freely available for download from GitHub.In addition, the presentation will include a short live demo of a real-world RISC-V IoT device securely connected to a commercial cloud provider. Key TakeawaysBuilding secure IoT devices with RISC-V is challenging because the ISA lacks a standard Trusted Execution Environment and a relative standard secure IoT firmware.To develop secure IoT applications, the MultiZone Secure IoT Stack provides state-of-the-art 32-bit SoC IP, TEE, RTOS, TCP/IP, TLS, ECC, PKI, MQTT, OTA firmware updates, and cloud broker.The secure IoT stack works with any RISC-V processors and cloud providers, it is built on free and open standards, distributed under permissive licensing, and available today at https://github.com/hex-five/multizone-secure-iot-stack.",
    "url": "https://player.vimeo.com/video/488681060?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-09T21:30:00+00:00",
    "utcendtime": "2020-12-09T21:50:00+00:00",
    "title": "Secure IoT Firmware for RISC-V",
    "topic": "Security & Functional Safety",
    "kind": "Conference",
    "presenter": "Cesare Garlati · Hex Five Security",
    "organization": null
  },
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc1NTEy",
    "description": "Presents an overview of SmartDV’s solutions to aid the RISC-V based design and verification. The session talks about SmartDV’s currently available RISC-V CPU verification solution and TileLink Verification IPs.  Key Takeaway Understanding of where SmartDV’s RISC-V based products fit into your RISC-V flow. How SmartDV is unique in its offerings differentiating it from other vendors. ",
    "url": "https://player.vimeo.com/video/488684590?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-09T21:50:00+00:00",
    "utcendtime": "2020-12-09T22:00:00+00:00",
    "title": "Tech Talk with SmartDV: SmartDV’s RISC-V Solutions",
    "topic": "Tech Talk",
    "kind": "Tech Talk",
    "presenter": "Bipul Talukdar · SmartDV",
    "organization": null
  },
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc1NTEx",
    "description": "Memory compression allows data to be stored compactly in memory, thereby increasing memory capacity without increasing the amount of physical memory. This translates into higher performance and thereby a higher performance/watt ratio.For server systems, when memory capacity per socket has maxed out, adding more sockets to increase the amount of physical memory leads to lower system performance and cost. For smart devices, such as smartphones, memory compression can offer higher memory capacity thereby boosting the user-perceived value at lower cost.We present Ziptilion™, the first general-purpose IP-block product for integration in microprocessor SoCs, such as RISC-V, developed by the fabless Swedish company ZeroPoint Technologies. It enables an unprecedented memory expansion by a factor 2.5X and 30% more effective memory bandwidth. We discuss how the IP-block is architected and integrated into a RISC-V based system. A first technical contribution is new statistical, real-time compression algorithms offering substantially higher compression ratios than what is known from state of the art. Another technical contribution is the novel approach taken by Ziptilion™ to manage the compressed memory in an operating-system (OS) transparent way through by forming an ultrafast large RAM-based swap space from the memory freed up by compression. Finally, Ziptilion™ offers novel optimizations at the hardware level to deal with ultrafast memory-side translation between the OS-physical and the compressed address spaces. Key TakeawaysThe audience will learn about a new product IP that can be integrated in a RISC-V SoC, significantly improving the system memory performance/watt by applying a memory compression technology. The IP solution is independent of the underline memory technologies (e.g., DDR, HBM, NVMe). The presentation will show an evaluation of the IP product presenting performance, power and area.The audience will gain technical knowledge in the field of memory compression and will be exposed to technical challenges and pragmatic solutions.The audience will learn about a novel HW/SW IP solution integrated to RISC-V systems. Thus insights will be gained about the integration process: how we integrate the HW part in the memory access path and the SW path in the Linux OS.",
    "url": "https://player.vimeo.com/video/488681756?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-09T22:00:00+00:00",
    "utcendtime": "2020-12-09T22:20:00+00:00",
    "title": "Ziptilion™: Boosting RISC-V with An Efficient and O/S Transparent Memory Compression System",
    "topic": "Hardware Cores/SoCs",
    "kind": "Conference",
    "presenter": "Angelos Arelakis · ZeroPoint Technologies AB",
    "organization": null
  },
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc1NTEw",
    "description": "System on a chip (SoC) design and manufacturing have become among the necessities of the modern IC design world. However, giving the timing criticality, it is incredibly costly for a developer to discover a bug after the long process of creating the final layout. The developer would then go back to reviewing HDL files and carrying out the hardening flow from scratch. This process has become rather systematic and algorithmic, which explains the increase in the number of available open-source tools that carry out chip design. With keen observation, we also find that the similarities between different systems on chips are common Intellectual Properties (IPs) that communicate with the master via the system bus. Henceforth came the idea of automating the process of generating the HDL code of an SoC utilizing verified open-source IPs from a library that is easily extensible by users.In this work, we present an open-source workflow capable of generating layout from high-level deep embedded SoC architectural description. The flow starts with a JavaScript Object Notation (JSON) representation of the SoC and ends with a verified layout (GDS2) for the SoC. The workflow relies on open-source EDA tools and IPs and skywater-pdk SKY130, the recently released open-source Physical Design Kit (PDK). The flow incorporates the OpenROAD framework and was used to implement striVe SoC (sent for manufacturing) and several other SoC configurations (to be tape-out in 8/2020) that evaluate and demonstrates design and flow KPI's with proven silicon performance. ",
    "url": "https://player.vimeo.com/video/488681386?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-09T22:00:00+00:00",
    "utcendtime": "2020-12-09T22:20:00+00:00",
    "title": "A Complete no-human-in-the-loop Open-Source \"Idea to Manufacturing\" SoC Compiler",
    "topic": "Software & Tools",
    "kind": "Conference",
    "presenter": "Mohamed Shalan · The American University, Cairo",
    "organization": null
  },
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc1NTA5",
    "description": "Codasip, the leading provider of customizable RISC-V processor IP, offers a range of various microarchitectural implementations of the RISC-V standard for virtually any application requirements. In this session, we will look at the newest member of the Codasip's RISC-V processor family, A70XP-MP. The A70XP-MP is a new Linux-capable processor available in a multi-processor cluster and offering a P extension.  Key Takeaways Codasip's Application Cores  Multiprocessor Solutions  Domain Specific Processors DSP (P) Extension",
    "url": "https://player.vimeo.com/video/488682942?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-09T22:00:00+00:00",
    "utcendtime": "2020-12-09T22:20:00+00:00",
    "title": "Codasip Application Class RISC-V Processor Solutions",
    "topic": "System Architectures",
    "kind": "Conference",
    "presenter": "Zdeněk Přikryl · Codasip",
    "organization": null
  },
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc1NTA4",
    "description": "Overview of the GD32VF103 including the current ecosystem.",
    "url": "https://player.vimeo.com/video/488682163?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-09T22:20:00+00:00",
    "utcendtime": "2020-12-09T22:30:00+00:00",
    "title": "Tech Talk with GigaDevice: GD32VF103 A RISC-V based MCU",
    "topic": "Tech Talk",
    "kind": "Tech Talk",
    "presenter": "Reuben Townsend · GigaDevice Semiconductor Ltd",
    "organization": null
  },
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc1NTA3",
    "description": "In this session, SemiDynamics will disclose its new RISC-V application cores, targeted at bandwidth-hungry application domains such as Machine Learning, Recommendation Systems, Sparse Computation, HPC and Key-Value Stores. SemiDynamics will also open source its \"Open Vector Interface (OVI)\", a public spec that allows third-parties to design their own vector unit and connect it to SemiDynamics cores. The session will cover the entry-level in-order Avispado family and the mid-range Venooom out-of-order family of cores. Both families support the OVI and are available for licensing. Key TakeawaysTwo new families of cores will be introduced: in-order and out-of-orderVery high-bandwidth capable. Ideal for SoC/Domains where high bandwidth an low area is neededOpen Vector Interface that will facilitate developing specialized vector units will be disclosed",
    "url": "https://player.vimeo.com/video/488681503?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-09T22:30:00+00:00",
    "utcendtime": "2020-12-09T22:50:00+00:00",
    "title": "SemiDynamics new family of High Bandwidth Vector-capable Cores",
    "topic": "Hardware Cores/SoCs",
    "kind": "Conference",
    "presenter": "Roger Espasa · SemiDynamics Technology Services",
    "organization": null
  },
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc1NTA2",
    "description": "Many security attacks focus on the vulnerabilities of r platforms and access or tamper sensitive data. Those attacks trigger malicious bus transactions to achieve their goals. Thus, system designers need mechanisms to distinguish safe transactions from malicious transactions. To build a secure platform, such mechanisms are indispensable.In this talk, we will introduce a secure platform in which every transaction is ensured its permission. Bus masters, e.g. CPU and DMA, are the ones issuing transactions. We already have PMP in charge of regulating transactions issued from RISC-V processors. Here, we will propose an enhanced IOPMP, enIOPMP for short, to regulate transactions issued from the rest, where IOPMP is originated from the previous proposals in TEE Task Group.The step of initializing PMP and enIOPMP is crucial. Secure boot plays an important role here, so we will provide a recommended flow to initialize a secure platform: when and how to initialize PMP and enIOPMP. The properly-initialized PMP or enIOPMP are considered as regulated checkers. In addition, the key enhanced features of the proposed enIOPMP are presented, e.g. speculation, violation handling, and master-id arrangement.Security monitor is in charge of manipulating these regulated checkers after secure boot. Some usage cases of security monitor will also be presented.Contemporary IC designs may have several smaller and even nested subsystems, which may have their own sensitive data to protect. At the end of the talk, we will introduce the concept of MID-space and IOPMP-gateways to architect a bigger secure platform from smaller secure subsystems.Session Take-awaysFeatures of Enhanced IOPMPBuild secure platforms by PMP + IOPMP + secure bootArchitect Larger Secure Platforms",
    "url": "https://player.vimeo.com/video/488684844?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-09T22:30:00+00:00",
    "utcendtime": "2020-12-09T22:50:00+00:00",
    "title": "Building a Secure Platform with the Enhanced IOPMP",
    "topic": "Security & Functional Safety",
    "kind": "Conference",
    "presenter": "Paul Shan-Chyun Ku · Andes Technology",
    "organization": null
  },
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc1NTA1",
    "description": "From a semiconductor hardware perspective, tradeoffs between the three key metrics of Power, Performance and Area (PPA) are well known and critically important in the optimization of a design. In this paper, results from a set of redefined \"software PPA\" metrics are examined. Based on porting multiple real-world production microcontroller security and other applications from Arm Cortex-M cores to open source RISC-V cores, these revisited metrics were studied. Two different security applications, both functioning as independent \"black box\" secure enclaves, were analyzed in detail. Using the redefined definitions, performance in terms of execution cycle counts and dynamic instruction pathlength, power in terms of silicon dissipation plus memory access types and rates and dynamic stack footprint, and static code size as a proxy for area are presented and compared. Key TakeawaysReal-world static code density comparisons from production software packagesEffects of standard compiler optimization flags versus static code sizesRelative static code sizes between GCC, LLVM and proprietary compilers Real-time performance metric comparisons ",
    "url": "https://player.vimeo.com/video/488682515?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-09T22:30:00+00:00",
    "utcendtime": "2020-12-09T22:50:00+00:00",
    "title": "Software \"PPA\" Metrics: More Results from Real-World Applications",
    "topic": "Software & Tools",
    "kind": "Conference",
    "presenter": "Joe Circello · NXP Semiconductors, N.V.",
    "organization": null
  },
  {
    "link": "https://riscvsummit.app.swapcard.com/event/risc-v-summit/planning/UGxhbm5pbmdfMjc1NTA0",
    "description": "Embedded systems development usually starts with gathering requirements but the more complex the device is, the more difficult it is to accurately establish the needs. Once you do that, you find or make customer hardware that meets those requirements and then the software development phase begins. However, it is likely that at some point it will turn out that not all of your original design choices were optimal so you update your hardware and software and start another development cycle, which is costly and time consuming. But it doesn’t have to be. This talk will present modern methods of system development based on modular open source solutions, such as Antmicro’s simulation framework Renode and the soft SoC generator LiteX. Such an approach solves some of the typical problems that designers encounter when creating embedded systems, as it allows them to develop hardware in an agile and incremental way, focusing on the needs of the product rather than being limited by initial hardware choices. We will also present how Renode, which has extensive RISC-V support, enables pre-hardware development of software, giving system architects the means to evaluate their design choices at a very early stage of the cycle, and to test the whole hardware/software setup in a Continuous Integration environment, which translates into a more efficient development process and a better final product. Featuring a number of RISC-V cores besides other architectures, the open source SoC generator, LiteX and its ecosystem are well supported in Renode, while its Zephyr and Linux ports, both actively developed by Antmicro and used in their industrial systems, as well as the dynamic community make it easy to start developing in LiteX. The presentation will explain how these modular open source solutions make for a robust set of tools that can transform advanced systems development. Session Takeaway The audience will learn how open source and modular tools can be used to overcome challenges that are common in embedded systems development.",
    "url": "https://player.vimeo.com/video/488683164?title=0&byline=0&color=092864&autoplay=1&dnt=1&app_id=122963",
    "utcstarttime": "2020-12-09T22:50:00+00:00",
    "utcendtime": "2020-12-09T23:00:00+00:00",
    "title": "Tech Talk with Antmicro: Building your world out of blocks with Renode and LiteX",
    "topic": "Tech Talk",
    "kind": "Tech Talk",
    "presenter": "Piotr Zierhoffer · Antmicro",
    "organization": null
  }
]